[
    {
        "key": "firewall",
        "image": "../../assets/image/13-jan-2023/firewall.png",
        "title": "Pengertian dan cara kerja Firewall",
        "writter": "Andi Ahmad Yusup - 13 Jan 2022",
        "type": "image",
        "video": "",
        "detail" : "Firewall adalah sebuah alat keamanan siber yang menyaring lalu lintas masuk dan keluar. Sistem Firewall bertugas mengontrol akses lalu lintas jaringan yang dianggap sah atau aman sehingga mencegah terjadinya serangan dari luar. Mayoritas Firewall bahkan telah menjadi satu dengan sistem operasi sebuah komputer termasuk Mac, Windows, dan Linux. Perangkat lunak ini sering dianggap sebagai komponen paling penting dalam keamanan jaringan. \n Tujuan utama dari sistem ini adalah membuat suatu penghalang antara jaringan internal yaitu perangkat Anda dengan lalu lintas eksternal entah itu berasal dari internet atau yang lainnya. Sehingga terdapat suatu kontrol dari akses pihak luar. Istilah Firewall juga sering kali digunakan untuk merujuk pada sistem yang berfungsi mengatur komunikasi antara dua arah jaringan. \n <h4> Bagaimana cara kerja Firewall? </h4>\n Prinsip kerja Firewall yaitu dengan menyaring pergerakan lalu lintas jaringan berdasarkan alamat IP, nomor port, program, protokol dan kata kunci sehingga dapat menyaring data dengan cara mengidentifikasi isi pesan yang masuk ke perangkat yang digunakan. Perpindahan data yang terjadi saat Anda terhubung ke internet juga dapat diatur oleh sistem Firewall. Firewall membuat batas antara jaringan eksternal dengan jaringan yang dijaga.\n Firewall akan masuk ke koneksi jaringan dan memeriksa semua paket yang masuk dan keluar. Saat memeriksa, Firewall menggunakan sekumpulan aturan yang telah dikonfigurasi sebelumnya untuk membedakan antara paket aman dan berbahaya. Istilah ‘paket’ mengacu pada potongan data yang diformat untuk transfer internet. Paket berisi informasi mengenai data yang digunakan seperti lokasi asal data. Apabila paket ini tidak mematuhi aturan yang ditetapkan, maka akan dilarang memasuki jaringan yang dijaga oleh Firewall.\n <h4> Apakah Firewall penting? </h4> \nFirewall penting karena memiliki pengaruh besar pada lapisan keamanan perangkat. Firewall telah menjadi fondasi keamanan jaringan antara klien dan server. Selain sebagai benteng pertahanan dari ancaman secara langsung, Firewall juga berfungsi menyimpan log peristiwa untuk mengidentifikasi pola guna memperbarui aturan keamanan siber. Dengan demikian, pengguna akan menerima peringatan jika terjadi gangguan dari luar.  "
    },
    {
        "key": "service-management-system-linux",
        "image": "../../assets/image/13-jan-2023/smsl.png",
        "title": "Service Management System Linux",
        "writter": "Andi Ahmad Yusup - 13 Jan 2022",
        "type": "image",
        "video": "",
        "detail" : "Service management system Linux adalah sebuah sistem yang digunakan untuk mengatur dan mengelola layanan yang berjalan pada sistem operasi Linux. Ini menyediakan mekanisme yang digunakan untuk mengontrol layanan yang dijalankan pada sistem, seperti menjalankan, menghentikan, atau mereset layanan. \n Salah satu sistem manajemen layanan yang populer pada Linux adalah systemd. Ini adalah sistem manajemen layanan yang digunakan pada distribusi Linux modern seperti Ubuntu, Fedora, dan Arch Linux. systemd menyediakan antarmuka yang mudah digunakan untuk mengelola layanan dan juga menyediakan fitur-fitur tambahan seperti pengelolaan sesi dan jaringan. \n Untuk mengelola layanan pada sistem operasi Linux yang menggunakan systemd, Anda dapat menggunakan perintah-perintah seperti systemctl. Perintah ini dapat digunakan untuk menjalankan, menghentikan, atau mereset layanan. Anda juga dapat mengecek status layanan dengan menjalankan perintah systemctl status. \n Selain systemd, ada juga sistem manajemen layanan lain seperti Upstart dan SysVinit. Upstart digunakan pada distribusi Linux seperti Ubuntu sebelum versi 15.04, sementara SysVinit digunakan pada distribusi Linux lama. Meskipun tidak digunakan lagi pada distribusi Linux modern, kedua sistem ini masih dapat digunakan jika diperlukan. \n Service management system Linux juga menyediakan mekanisme untuk mengatur konfigurasi layanan. Biasanya, file konfigurasi layanan disimpan di direktori /etc/systemd/system atau /lib/systemd/system. Anda dapat mengedit file konfigurasi ini untuk mengubah konfigurasi layanan, seperti mengubah port yang digunakan atau menambahkan opsi tambahan. \n Sebagai contoh, jika Anda ingin mengubah port yang digunakan oleh layanan web Apache, Anda dapat mengedit file konfigurasi /etc/systemd/system/httpd.service dan mengubah opsi Listen. Setelah menyimpan perubahan, Anda dapat menjalankan perintah systemctl reload untuk menerapkan perubahan konfigurasi. \n Selain itu, Service management system Linux juga dapat digunakan untuk menjalankan layanan secara otomatis saat sistem boot. Ini dapat dilakukan dengan mengatur layanan untuk dijalankan secara otomatis saat sistem boot dengan menjalankan perintah systemctl enable [nama layanan]. Ini akan menambahkan layanan ke daftar layanan yang dijalankan saat sistem boot. Anda juga dapat menonaktifkan layanan untuk dijalankan secara otomatis saat boot dengan menjalankan perintah systemctl disable [nama layanan].\n Manajemen layanan pada sistem operasi Linux sangat penting untuk menjaga kestabilan sistem dan menjaga layanan yang diperlukan berjalan dengan baik. Dengan menggunakan sistem manajemen layanan seperti systemd, Anda dapat dengan mudah mengelola layanan pada sistem operasi Linux dan mengatur konfigurasi layanan sesuai kebutuhan.   "
    },
    {
        "key": "container-linux",
        "image": "../../assets/image/13-jan-2023/container.png",
        "title": "Pengertian, Kelebihan dan Kekuarangan Container",
        "writter": "Andi Ahmad Yusup - 13 Jan 2022",
        "type": "image",
        "video": "",
        "detail" : "Kalian pasti pernah dengar istilah container kan? Container adalah virtualisasi tingkat sistem operasi. Bisa juga disebut sebagai vitualisasi yang ringan. Karena hanya menyediakan kebutuhan minimum yang dibutuhkan sebuah aplikasi supaya bisa berjalan. Container merupakan virtual machine minimalis yang tidak berjalan pada hypervisor. Lalu apa saja yang ada di dalam container? Berikut ini yang ada dalam container : \n <ul class='ul-sistem-linux'> <li> Application</li> <li>Binaries</li> <li>Configuration File</li> <li>Dependencies</li> <li>Libraries</li> </ul> \n Bagaimana caranya bisa berjalan di environment yang berbeda? Containerization memungkinkan container untuk berjalan di environment yang berbeda dengan cara mengabstraksi sistem operasi dan infrastruktur fisik. Sebuah aplikasi yang dijadikan container berbagi kernel host operating system dengan container yang lain. Bagian sistem operasi yang dibagi itu bersifat “Read-only”. Biasanya, dalam satu container hanya terdapat satu buah service atau microservice.\n <h4> Sesuatu tentang Linux Container </h4>\n Linux Container mengagumkan. Mereka digunakan secara luas karena mereka efektif. Linux cgroups membuat Linux Containers. Ia juga dikenal sebagai LXC. Implementasi utama pertama kontainer adalah LXC. Cara kerjanya dengan mengambil keuntungan dari isolasi cgroups dan namespace untuk menciptakan lingkungan virtual yang memiliki proses dan ruang jaringan yang terpisah.Sehingga mengarah pada ruang pengguna yang independen dan terisolasi. Singkatnya, konsep wadah saat ini berasal dari LXC. Versi Docker sebelumnya dibuat langsung di atas LXC. \n <h4> Kelebihan dan kekukangan container </h4> \n <h5> Kelebihan: </h5>\n <ul class='ul-sistem-linux'>   <li>Menjalankan container tidak menggunakan banyak sumber daya. Jadi seseorang dapat menambahkan lebih banyak beban kerja komputasi pada server yang sama.</li>  <li> Dibandingkan dengan mesin virtual, ukuran rata-rata suatu container berada dalam kisaran puluhan atau ratusan MB, sedangkan mesin virtual mengkonsumsi beberapa gigabytes. Server dapat menampung lebih banyak kontainer. </li>  <li> Kontainer cepat! Membuat container hanya membutuhkan beberapa detik. Waktu respons cepat ketika menyangkut aktivitas pengguna. Kontainer membantu mengurangi waktu yang dibutuhkan untuk pengembangan, pengujian, dan penyebaran. </li>  <li> Menemukan kesalahan dan menyelesaikannya mudah dengan container. Mengapa? Karena tidak ada perbedaan antara menjalankan aplikasi secara lokal atau pada server uji. </li> </ul> \n <h5> Kekurangan: </h5> \n<ul class='ul-sistem-linux'>  <li> Keamanan adalah masalah dengan virtualisasi berbasis container dibandingkan dengan mesin virtual tradisional. Dalam container, Kernel dan komponen lain dari sistem operasi host dibagikan. Mereka memiliki akses root! Jadi container kurang terisolasi satu sama lain. Secara keseluruhan, itu tergantung pada jenis aplikasi dan modifikasi. </li>  <li> Ada kurang fleksibilitas dalam sistem operasi. Jika Anda ingin menjalankan kontainer dengan sistem operasi yang berbeda, Anda harus memulai server baru. </li> </ul>   "
    },
    {
        "key": "journal-linux",
        "image": "../../assets/image/13-jan-2023/journal.jpg",
        "title": "Journal dalam Linux",
        "writter": "Andi Ahmad Yusup - 13 Jan 2022",
        "type": "image",
        "video": "",
        "detail" : "Journal Linux adalah sebuah mekanisme yang digunakan untuk mencatat log sistem dan aktivitas yang terjadi pada sistem operasi Linux. Journal menyimpan informasi tentang berbagai event seperti boot, shutdown, error, dan aktivitas dari aplikasi dan proses yang berjalan di sistem. \n Journal Linux menggunakan teknologi systemd untuk mencatat log sistem dan aktivitas. Teknologi ini menyediakan mekanisme yang cepat dan efisien untuk mencatat log sistem dan aktivitas yang terjadi di sistem. Journal Linux juga menyediakan pemantauan real-time yang memungkinkan Anda untuk mengecek log sistem dan aktivitas yang terjadi pada sistem saat ini. \n Selain itu, Journal Linux juga menyediakan kapabilitas pencarian dan analisis data yang memungkinkan Anda untuk menemukan dan menganalisis log sistem dan aktivitas yang spesifik. Hal ini sangat berguna dalam mengidentifikasi masalah yang mungkin terjadi pada sistem dan menemukan solusi untuk masalah tersebut. \n <h4> Journalctl </h4> \nJournalctl adalah sebuah utilitas untuk melakukan kueri dan menampilkan log dari journald dan journald ini adalah sebuah service log yang terdapat pada systemd. Untuk menggunakan journalctl ini cukup mudah, cukup ketik perintah berikut pada terminal: \n <div class='code'> Journalctl </div> \n Baris pertama yang akan tampil seperti berikut:\n <div class='code'> -- Journal begins at Mon 2023-01-09 16:33:19 WIB, ends at Fri 2023-01-13 15:36:26 WIB. – </div> \n  Dari baris pertama ini menjelaskan bahwa log yang tersimpan dari tanggal 09 Januari 2023 pukul 16:33 sampai dengan tanggal 13 Januari 2023 pukul 15:36. Dari sini kita tahu bahwa Linux saya baru saya install awal tahun ini.  "
    },
    {
        "key": "autofs",
        "image": "../../assets/image/13-jan-2023/autofs.png",
        "title": "Autofs",
        "writter": "Andi Ahmad Yusup - 13 Jan 2022",
        "type": "image",
        "video": "",
        "detail" : "Autofs adalah sebuah sistem pemount otomatis yang digunakan untuk me-mount file system secara otomatis saat diakses dan melepas file system saat tidak digunakan. Ini memungkinkan sistem untuk menghemat sumber daya dan meningkatkan efisiensi karena file system hanya dimount saat diperlukan. \n Autofs digunakan untuk me-mount file system yang berada pada jaringan, seperti file server NFS atau SMB, atau perangkat penyimpanan lokal seperti flash drive. Anda dapat mengkonfigurasi autofs untuk me-mount file system secara otomatis saat diakses, dan melepas file system saat tidak digunakan. \n Untuk menggunakan autofs, Anda harus mengkonfigurasi file konfigurasi autofs, yaitu /etc/autofs.conf dan /etc/auto.master. File konfigurasi autofs.conf mengandung pengaturan global untuk autofs, seperti interval polling dan timeout. File konfigurasi auto.master mengandung entri yang menentukan file system mana yang akan dimount oleh autofs dan di mana file system tersebut akan di-mount. \n Anda dapat mengkonfigurasi autofs untuk me-mount file system pada jaringan dengan menambahkan entri pada file konfigurasi auto.master yang menunjukkan alamat file server dan direktori yang ingin di-mount. Anda juga dapat mengkonfigurasi autofs untuk me-mount perangkat penyimpanan lokal seperti flash drive dengan menambahkan entri pada file konfigurasi auto.master yang menunjukkan device node dan direktori di mana perangkat tersebut akan di-mount. \n Autofs juga memiliki fitur yang disebut \"direct maps\", yang memungkinkan Anda untuk mengkonfigurasi file system untuk di-mount secara langsung tanpa harus mengakses direktori yang mengandung file system tersebut. Ini memungkinkan Anda untuk mengakses file system langsung melalui alamat URL atau device node. \n Selain itu, Autofs juga memiliki fitur yang disebut \"indirect maps\", yang memungkinkan Anda untuk mengkonfigurasi file system untuk di-mount secara tidak langsung dengan mengakses direktori yang mengandung file system tersebut. Ini memungkinkan Anda untuk mengakses file system melalui direktori yang di-mount. "
    },
    {
        "key": "crontab",
        "image": "../../assets/image/13-jan-2023/crontab.png",
        "title": "Pengertian Crontab",
        "writter": "Andi Ahmad Yusup - 13 Jan 2022",
        "type": "image",
        "video": "",
        "detail" : "Crontab adalah sebuah perintah yang digunakan pada sistem operasi Linux untuk menjadwalkan tugas yang akan dijalankan secara otomatis pada waktu tertentu. Tugas yang dapat dijadwalkan meliputi skrip, perintah, atau aplikasi yang dapat dijalankan dari command line.  \n Crontab digunakan untuk menjadwalkan tugas yang diinginkan dengan menentukan waktu dan jadwal yang ditentukan. Contohnya, Anda dapat menentukan crontab untuk menjalankan suatu skrip setiap hari pada pukul 03:00 pagi. Atau Anda dapat menentukan crontab untuk menjalankan suatu perintah setiap minggu pada hari Senin pukul 09:00. \n Crontab sangat berguna dalam mengelola tugas yang dijadwalkan di sistem operasi Linux, seperti menjalankan backup rutin, membersihkan file sampah, atau mengirimkan laporan secara otomatis. Dengan menggunakan crontab, Anda dapat menjadwalkan tugas tanpa harus terus-menerus mengecek sistem dan menjalankan tugas secara manual. \n Untuk membuat jadwal menggunakan crontab, klean harus mengacu pada format penulisan crontab seperti berikut : \n<div class='code'> MIN HOUR DOM MON DOW CMD</div> \n <table class='tbl tbl-crontab'> <tr> <th> Field</th><th> Description    </th><th> Allowed Value </th> </tr> <tr> <td> MIN</td> <td> Minute field</td><td>0 to 59 </td> </tr> <tr> <td> HOUR     </td> <td> Hour field      </td> <td>0 to 23 </td> </tr> <tr> <td> DOM      </td> <td> Day of Month    </td> <td>1-31 </td> </tr> <tr> <td> MON      </td> <td> Month field     </td> <td>1-12 </td> </tr> <tr> <td> DOW      </td> <td> Day Of Week     </td> <td>0-6 </td> </tr> <tr> <td> CMD      </td> <td> Command         </td> <td> Any command to be executed. </td> </tr> </table>  "
    },
    {
        "key": "selinux",
        "image": "../../assets/image/13-jan-2023/selinux.svg",
        "title": "SELinux",
        "writter": "Andi Ahmad Yusup - 13 Jan 2022",
        "type": "image",
        "video": "",
        "detail" : "SELinux (Security Enchaced Linux) merupakan salah satu peningkatan keamanan dari sebuah sistem operasi berbasi Linux. Keamanan ini berguna untuk membedakan antara user root atau super user dengan user terbatas. Security ini juga akan mengatur file permission read, write, executable.\n Bagi yang sudah mempelajari tentang linux, pasti kalian tidak asing lagi tentang tingkatan user terbatas dengan user root. Jadi, setiap user pun akan dibatasi untuk mengantisipasi terjadinya kecerobohan dalam suatu proses yang tidak diinginkan. Aplikasi mendasar dari SELinux ini adalah layanan FTP (file transfer protocol) dan HTTP (hyper text transfer protocol). \n Kalau dalam proses tradisional user langsung di handle oleh daemon dari FTP dan HTTP maka dengan penerapan SELinux  ini user linux dipetakan ke user SELinux kemudian SELinux akan menentukan boleh dan tidaknya akses FTP dan HTTP. SELinux ini memberi security tambahan antara user dengan proses. Di sini security pertama kali dicek oleh tradisional Linux system, jika diperbolehkan maka akan dicek lagi oleh SELinux. SELinux hanya akan mengecek proses yang sudah lewat dari tradisional Linux system, dan yang tidak lolos dari aturan tradisional Linux system tidak akan dicek oleh SELinux. SELinux mengikuti aturan untuk membuat privilage paling rendah dengan demikian menekankan keamanan, kemudian baru dilanjutkan dengan serangkaian aturan exception. \n <h4>SELinux memiliki 3 mode, yaitu :</h4> <ul class='ul-sistem-linux'> <li><b>Enforcing</b>, merupakan setingan keamanan yang paling ketat</li> <li><b>Permissive</b>, setting ini merupakan setting keamanan yang longgar. </li><li><b>Disabled</b>, ini merupakan setting untuk mematikan SELinux</li></ul>"
    },
    {
        "key": "tuned-profile",
        "image": "../../assets/image/13-jan-2023/tuned.png",
        "title": "Tuned Profile",
        "writter": "Andi Ahmad Yusup - 13 Jan 2022",
        "type": "image",
        "video": "",
        "detail" : "Tuned profile adalah sebuah mekanisme yang digunakan untuk mengoptimalkan kinerja sistem Linux dengan menyesuaikan konfigurasi sistem dan pengaturan untuk kondisi spesifik. Profil ini dapat diterapkan pada sistem yang digunakan untuk berbagai tujuan, seperti server web, database, atau aplikasi khusus. \n Tuned profile dikembangkan oleh Red Hat dan dapat digunakan dengan berbagai distribusi Linux. Ini menyediakan berbagai profil yang dapat digunakan untuk mengoptimalkan kinerja sistem. Profil yang tersedia dapat diadaptasi untuk kondisi spesifik, seperti jumlah memori, jumlah CPU, atau konfigurasi jaringan. \n Tuned profile mengubah konfigurasi sistem dan pengaturan yang diperlukan untuk meningkatkan kinerja sistem. Ini dapat mengoptimalkan pengaturan kernel, mengubah pengaturan I/O, atau menyesuaikan pengaturan jaringan. Tuned profile juga dapat mengaktifkan atau menonaktifkan fitur yang tidak diperlukan untuk meningkatkan kinerja sistem. \n Secara keseluruhan, tuned profile adalah cara yang efektif untuk mengoptimalkan kinerja sistem Linux. Dengan menyesuaikan konfigurasi dan pengaturan untuk kondisi spesifik, Anda dapat meningkatkan kinerja sistem dan membuat sistem lebih responsif. Tuned profile juga memudahkan dalam mengelola sistem dengan menyediakan profil yang dapat digunakan secara umum dan dapat diadaptasikan untuk kebutuhan spesifik. \n Salah satu keuntungan utama dari Tuned profile adalah konfigurasi yang diterapkan dapat dioptimalkan untuk kondisi spesifik dari sistem. Ini dapat meningkatkan kinerja sistem secara signifikan dibandingkan dengan konfigurasi default yang diterapkan pada sistem. Selain itu, Tuned profile juga dapat digunakan untuk mengoptimalkan kinerja sistem untuk berbagai jenis aplikasi, seperti server web, database, atau aplikasi lainnya. \n  <h4>Fitur Tuned Profile</h4>\n Tuned profile menyediakan berbagai fitur untuk mengoptimalkan kinerja sistem Linux. Salah satu fitur utama adalah konfigurasi yang dapat dioptimalkan untuk kondisi spesifik dari sistem. Ini dapat meningkatkan kinerja sistem secara signifikan dibandingkan dengan konfigurasi default yang diterapkan pada sistem. Selain itu, Tuned profile juga dapat digunakan untuk mengoptimalkan kinerja sistem untuk berbagai jenis aplikasi, seperti server web, database, atau aplikasi lainnya. \n Tuned profile juga menyediakan fitur pemantauan yang memungkinkan Anda untuk mengawasi kinerja sistem dan menganalisis data yang tersimpan. Anda dapat menggunakan fitur ini untuk mengetahui seberapa efisien sistem Anda digunakan, mengidentifikasi masalah yang mungkin terjadi, dan mengambil tindakan yang diperlukan untuk mengatasinya. Selain itu, Anda dapat menggunakan fitur ini untuk mengoptimalkan kinerja sistem selama runtime, tanpa harus melakukan restart sistem. \n Selain itu, Tuned profile juga menyediakan integrasi dengan teknologi lain, seperti backup dan disaster recovery, untuk membantu Anda mengelola sistem dengan lebih baik. Selain itu, Tuned profile juga menyediakan pembaruan yang dapat diunduh secara otomatis, memastikan bahwa sistem Anda selalu dioptimalkan dengan konfigurasi terbaru. Dengan fitur-fitur ini, Tuned profile memudahkan dalam mengelola sistem dan meningkatkan kinerja sistem Linux. "
    },
    {
        "key": "virtual-data-optimizer",
        "image": "../../assets/image/13-jan-2023/vdo.jpg",
        "title": "Virtual Data Optimizer (VDO)",
        "writter": "Andi Ahmad Yusup - 13 Jan 2022",
        "type": "image",
        "video": "",
        "detail" : "Virtual Data Optimizer (VDO) adalah sebuah perangkat lunak berbasis Linux yang dikembangkan oleh Red Hat yang memberikan kompresi data inline dan deduplikasi untuk sistem penyimpanan berbasis blok. Hal ini memungkinkan penggunaan sumber daya penyimpanan yang lebih efisien dan dapat secara signifikan mengurangi jumlah ruang penyimpanan yang dibutuhkan untuk jumlah data tertentu. VDO dirancang untuk bekerja dengan Logical Volume Manager (LVM) dan dapat digunakan dengan berbagai backend penyimpanan, termasuk disk, SAN dan NAS.\n VDO juga dapat digunakan untuk meningkatkan performa sistem penyimpanan dengan mengurangi jumlah operasi disk yang diperlukan untuk menyimpan dan mengambil data. Hal ini dapat mengurangi latensi dan membuat sistem lebih responsif. VDO juga menyediakan fitur pemantauan dan analisis untuk membantu dalam mengelola dan menganalisis kinerja sistem penyimpanan.\n Secara keseluruhan, VDO memberikan solusi yang fleksibel dan efisien untuk mengelola dan mengoptimalkan penyimpanan data di sistem Linux. Dengan kompresi dan deduplikasi data, VDO dapat mengurangi biaya penyimpanan dan meningkatkan kinerja sistem. Fitur pemantauan dan analisis juga membantu dalam mengelola sistem dengan lebih baik.\n VDO menggunakan teknologi deduplikasi yang membandingkan data yang sama dan hanya menyimpan satu salinan dari data yang sama. Ini mengurangi ruang yang digunakan oleh data duplikat dan meningkatkan efisiensi penyimpanan. Pada saat yang sama, VDO juga menggunakan teknologi kompresi untuk mengurangi ukuran data sebelum disimpan. Hal ini mengurangi ukuran data yang disimpan dan meningkatkan kecepatan akses data.\n VDO juga menyediakan fitur pemantauan yang memungkinkan Anda untuk mengawasi kinerja sistem dan menganalisis data yang tersimpan. Anda dapat menggunakan fitur ini untuk mengetahui seberapa efisien sistem Anda digunakan, mengidentifikasi masalah yang mungkin terjadi, dan mengambil tindakan yang diperlukan untuk mengatasinya."
    },
    
    {
        "key": "swap-partition",
        "image": "../../assets/image/13-jan-2023/swap.jpeg",
        "title": "Swap Partition",
        "writter": "Andi Ahmad Yusup - 13 Jan 2022",
        "type": "image",
        "video": "",
        "detail" : "Hola minna! Minna-san yang memakai Linux tentu tidak akan asing dengan namanya Swap. So, apa itu Swap ? Pentingkah membuat Swap saat menginstall Linux ? Benarkah Swap harus berukuran dua kali besar ram kita ? Disini watashi akan membahas nya. \n <h4>Pengertian Swap</h4>\n Swap adalah sebuah ruang pada harddisk yang dijadikan ruang virtual memory yang digunakan ketika komputer/laptop membutuhkan lebih banyak memory. Dalam artian partisi dengan filesystem Swap ini bekerja sebagai cadangan , apabila RAM yang digunakan penuh. Jadi sederhaana nya , Swap ini akan memberi pertolongan jika RAM yang kita kehabisan ruang kosong.\n Swap akan sangat berguna untuk komputer yang memiliki RAM berkapasitas minim. Fungsi ini mirip dengan fitur paging files pada OS Jendela. Swap juga digunakan untuk menyimpan data-data yang jarang digunakan di RAM.\n <h4>Fungsi Swap</h4> \n <ul class='ul-sistem-linux'> <li><b>Memory tambahan bagi aplikasi yang berjalan.</b> Kadang aplikasi yang berjalan menguras seluruh memory yang ada dan memerlukan memory ekstra agar dapat berjalan lebih maksimal.</li> <li><b>Hibernasi. </b>Fitur hibernasi menulis isi RAM ke partisi swap sebelum mematikan mesin. Oleh karena itu, partisi swap Anda harus setidaknya sebesar ukuran RAM Anda. Implementasi hibernasi yang saat ini digunakan di Ubuntu, swsusp, membutuhkan partisi swap atau suspend. Proses ini tidak dapat menggunakan swap file. </li> <li><b>Keadaan Tak Terduga. </b> Peristiwa yang tidak dapat diduga dapat dan akan terjadi (misalnya aplikasi hang, beberapa tindakan membutuhkan lebih banyak memory, atau kombinasi peristiwa tak terduga lainnya). Dalam kasus ini, swap dapat memberi kalian penundaan ekstra untuk mencari tahu apa yang terjadi, atau menyelesaikan apa yang sedang Anda kerjakan. </li> <li><b>Mengoptimalkan penggunaan memori. </b>Karena hard drive mekanis jauh lebih lambat daripada RAM (SSD - Solid State Drive - penyimpanan tidak selambat drive fisik, tetapi masih lebih lambat dari RAM), ketika Anda membutuhkan file (baik itu file data seperti video, dieksekusi seperti Firefox, atau pustaka), kernel Linux membaca file ke dalam RAM dan menyimpannya di sana, sehingga pada saat Anda membutuhkannya, itu sudah dalam RAM dan akses data jauh lebih cepat. Bagian-bagian RAM yang mempercepat pembacaan disk disebut \"cache memori.\" Anda akan melihat bahwa mereka membuat perbedaan besar dalam hal responsif. Kernel Linux secara otomatis memindahkan RAM yang disediakan oleh program - tetapi tidak benar-benar digunakan - ke dalam swap, sehingga dapat melayani tujuan yang lebih baik untuk memperluas memori cache. </li> <li><b>Mengoptimalkan kinerja Swap. </b>Karena ruang swap menggunakan perangkat disk, ini dapat menyebabkan masalah kinerja di sistem apa pun yang menggunakan ruang swap secara signifikan karena sistem itu sendiri mungkin juga menggunakan perangkat disk yang sama pada saat yang sama yang diperlukan untuk operasi swap. Salah satu cara untuk mengurangi masalah ini adalah memiliki ruang swap pada drive fisik yang berbeda sehingga persaingan untuk sumber daya itu dikurangi atau dihilangkan. </li> </ul>\n <h4>Lalu berapa sih ideal nya ukuran Swap ? </h4> \n Nah yang ini lumayan jadi perdebatan. Ada yang bilang wajib ukurannya dua kali ukuran RAM. Lah kalo ukuran RAM kayak punya saya, 8 GB, masa iya harus nge-swap 16 GB. kan sayang banget tuh ngebuang kapasitas hdd. Atau misalnya server dengan ram 128 GB, gila aja kalo swap nya harus kali dua dari RAM. \n Saya sendiri tidak tau siapa yang pertama kali mencanangkan ukuran swap harus dua kali RAM. Saya sendiri pernah terjebak dengan aturan tersebut. Namun mungkin hal itu dulu dilakukan karena rata-rata kapasitas memory yang sata itu masih kecil. Misal kalian punya RAM 512MB maka swap dibuat 1GB atau dua kali dari kapasitas RAM. \n Namun, penggunaan swap memang dianjurkan.Terutama untuk ram dengan kapasitas kecil misal 512MB, swap hukumnya \"wajib\" dibuat. Karena tentunya akan sangat membantu jika aplikasi yang berjalan membutuhkan memory ekstra. Untuk ram yang lebih besar, misal 4GB keatas, jika memang kalian sering melakukan hibernate pada sistem operasi kalian, maka swap menjadi \"wajib\". Tapi jika tidak, swap bisa dihilangkan. Namun mengingat kegunaan swap yang lumayan banyak, tidak ada salahnya mengorbankan sedikit kapasitas harddisk untuk membuat partisi swap. Dan <b> tidak wajib ukurannya dua kali ukuram memory. </b>Misal kalian punya RAM 8GB dan tetap ingin memasang swap, kalian pasang swap 2GB sudah cukup. \n <h4> Macam Macam Swap </h4>Swap sendiri bisa berbentuk partisi maupun file. Nah yang menggunakan partisi ini swap nya berbeda partisi dari sistem. Kelebihannya, kita cuma butuh satu partisi swap meski ingin menginstall banyak varian linux. jadi misal dual boot Debian dan Ubuntu, kita cuma butuh satu partisi swap. \n kedua adalah swap file. Swap file ini dibuat menyatu dengan file system. Kelebihannya, ukuran swap ini fleksibel alias bisa dirubah rubah. Jadi yang biasa ngubah kapasitas swap cocok pakai swap file, tapi kekurangannya, swap file ini hanya millik sistem yang berjalan saat itu. Jadi jika swap file di Ubuntu tentu tidak terbaca saat kalian boot ke Debian. Satu lagi, Swap file lebih lambat dalam hal performa dibanding swap partisi. \n <h4> Wajibkah Swap ini saat menginstall Linux ? </h4>Wajib tidaknya tergantung kebutuhan sesuai yang saya jelaskan diatas. Namun penggunaan swap sangat dianjurkan.   "
    },
    
    {
        "key": "repository-linux",
        "image": "../../assets/image/13-jan-2023/repo.webp",
        "title": "Repository Linux",
        "writter": "Andi Ahmad Yusup - 13 Jan 2022",
        "type": "image",
        "video": "",
        "detail" : "Repository atau  yang biasa disingkat repo merupakan sebuah alokasi ruang atau tempat untuk penyimpanan aplikasi yang memiliki jumlah ratusan atau bahkan mencapai ribuan yang bisa diakses melalui internet.  Selain bersifat online, repository juga menyediakan pilihan untuk bisa mengaksesnya melalui distribusi media lokal misalnya DVD yang memberikan kemudahan di dalam melakukan instalasi aplikasi. Salah satu kelebihan dengan adanya repository online yaitu Anda akan mendapatkan aplikasi atau distro yang lebih update. \n Perlu Anda ketahui bahwa di dalam Linux, terdapat beragam distro yang sudah tersedia. Dikarenakan jumlah distro yang banyak tersebut, maka hadirlah sebuah repository. Bisa kita ibarakan bahwa repository merupakan sebuah paket khusus yang terdapat di dalam distro. \n Repository inilah yang kemudian akan berperan di dalam menunjang aplikasi maupun program yang terdapat di dalam sistem operasi. Dengan begitu setiap paketnya tidak akan tercampur paket distro yang lainnya. \n <h4> Klasifikasi Repository (Berdasarkan Komponennya)  </h4>\n Jika kita mengambil contoh repository yang ada pada Ubuntu, maka kita akan menemukan bahwa akan ada 4 area. Keempat area tersebut antara lain: \n <ul class='ul-sistem-linux'> <li><b>Main : </b>  software yang memperoleh dukungan secara resmi </li> <li><b>Restricted : </b> software yang memperoleh dukungan namun tidak sepenuhnya bebas dari lisensi. Itu artinya, akan ada software gratis dan berbayar</li> <li><b>Universe : </b>  software ini dikelola oleh para komunitas Ubuntu</li> <li><b>Multiverse : </b> software yang tidak gratis (berbayar) </li> </ul> <h4> Klasifikasi Repository (Berdasarkan Post-Release) </h4>\n Sementara itu, klasifikasi dari repository berdasarkan post-release yang muncul pada setiap rilisnya, maka repository pada Ubuntu dibagi menjadi beberapa jenis: \n <ul class='ul-sistem-linux'> <li> <b> Release-security : </b>pembaruan keamanan</li> <li><b> Release-update :  </b>pembaruan berupa penambalan bug yang tidak berkaitan dengna keamanan</li> <li><b> Release-proposed : </b>pembaruan berupa penambalan bug khusus yang berguna untuk testing yang selanjutnya akan dimasukan ke dalam release-update</li> <li><b>Release-backports</b> : pembaruan paket yang telah dibuat berdasarkan rilis sebelumnya yang digunakan untuk rilis selanjutnya </li> </ul> "
    },
    {
    "key": "network-time-protocol",
    "image": "../../assets/image/13-jan-2023/ntp.png",
    "title": "Network Time Protocol (NTP)",
    "writter": "Andi Ahmad Yusup - 13 Jan 2022",
    "type": "image",
    "video": "",
    "detail" : "Network Time Protocol (NTP) merupakan protokol yang digunakan untuk melakukan sinkronisasi waktu pada sistem komputer dan jaringan. Proses sinkronisasi dilakukan di dalam jalur komunikasi data menggunakan protocol TCP/IP dan menggunakan port komunikasi User Datagram Protocol (UDP) 123. \n Sedangkan NTP Server adalah sebuah server yang melakukan sinkronisasi waktu terhadap sumber waktu yang akurat dan mentransmisikan paket informasi waktu tersebut kepada komputer client.  \n <h4>Fungsi NTP</h4> \n Sesuai dengan pengertian NTP, maka fungsi dari NTP adalah mengatur dan menyesuaikan (sinkronisasi) waktu antara komputer server dengan komputer client dalam jaringan. \n <h4>Mengapa waktu harus di sinkronkan :</h4> \n <ul class='ul-sistem-linux'>  <li>Perpindahan diantara 2 sistem yang berbeda waktu itu menyebabkan pergeseran waktu baik lebih cepat maupun lebih lambat.</li> <li>Sistem dengan jaringan yang terisolir akan selalu memungkinkan waktu yang salah. </li> <li>Namun ketika kita hubungkan ke internet, barulah akan terlihat pengaruhnya. </li> <li>Bayangkan jika ada sebuah sistem yang terisolir dengan jaringan menggunakan jam atau waktu yang salah, ketika berkirim email tertanggal 3 Maret dan email tersebut dibalas tertanggal 10 Oktober, padahal balasan email terkirim 2 hari yang lalu. </li> </ul> \n <h4>Cara Kerja NTP :</h4> \n NTP bekerja dengan menggunaka algoritma Marzullo dengan referensi skala waktu UTC. Biasanya jaringan NTP mendapat perhitungan waktu dari sumber terpercaya seperti Radio Clock atau Atomic Clock yang terhubung dengan sebuah time server dan akan didistribusikan ke dalam jaringan lain. \n Sebuah NTP Client akan melakukan sinkronisasi dengan NTP Server dalam sebuah interval pooling yang berkisar antara 64 sampai 1024 detik. Waktu sinkronisasi bergantung kepada kondisi dan keadaan jaringan yang akan digunakannya. "
   },
    {
        "key": "struktur-direktori-linux",
        "image": "../../assets/image/linux/linux-direktori.png",
        "title": "Struktur direktori Linux",
        "writter": "Andi Ahmad Yusup - 6 Jan 2022",
        "type": "image",
        "video": "",
        "detail": "Eyoyoyo what's up minna-san! Apakah minna-san merupakan user yang baru saja keluar melompati jendela dan berpindah pada pinguin? Jika ya, maka minna-san akan dibingungkan dengan struktur file sistem yang terlihat seperti Alien. “C:\\” atau drive lainnya yang ada di windows akan benar-benar menghilang dan digantikan oleh “/”(root) beserta direktori lainnya. \n Filesystem Hierarchy Standard (FHS) mendefinisikan struktur direktori filesystem Linux dan Sistem Operasi keluarga UNIX lainnya. Walaupun begitu, ada beberapa direktori pada filesystem Linux yang belum terdefinisikan di FHS. Berikut adalah pengenalan struktur direktori pada Linux.\n \n <table class='tbl'> <tr> <th>Direktori</th>     <th>Keterangan</th</tr><tr><td>/ - root</td><td> Direktori “/” merupakan sebuah direktori yang memiliki kedudukan paling tinggi dalam struktur linux. Semua file sistem linux berada di dalam direktori “/” (disebut sebagai direktori root). Direktori root bisa dikatakan mirip dengan “C:\\” nya windows, tetapi tidak sama. Pada Windows, partisi “C:\\” dan “D:\\” lokasinya terpisah. Sedangkan pada Linux, semua partisi berada di dalam satu lokasi, yaitu di dalam direktori root.</td></tr>  <tr><td>/bin</td><td>Direktori /bin berisi program-program penting yang dibutuhkan oleh sistem operasi untuk bekerja. Dalam direktori /bin terdapat perintah shell seperti bash, csh, dll. Selain itu, terdapat juga perintah yang umum digunakan seperti cp, mv, rm, cat, ls, dll.</td></tr><tr><td>/boot</td><td> Direktori ini berisi informasi mengenai boot loader. File-ﬁle yang terdapat di dalam direktori  \"/boot\" sangat dibutuhkan ketika komputer sedang booting. Kernel initrd, vmlinux, grub ﬁles berada di dalam \"/boot\".</td></tr><tr><td>/dev</td><td>Direktori “/dev” adalah direktori “spesial”, karena berisi file-file \"pseudo\" yang mewakili perangkat keras yang terpasang pada sistem. Sistem Linux menampilkan devices sebagai file, dan direktori “/dev” berisi file-file yang mewakilkan devices. Contohnya, file “sda” pada direktori “/dev” adalah file yang mewakilkan hard disk pertama pada komputer. File “sda1” mewakilkan partisi pertama pada hard disk pertama, dst. Semua devices pada sistem Linux ditampilkan di direktori ini. </td></tr><tr><td>/etc</td><td>Direktori “/etc” berisi file-file konfigurasi sistem secara keseluruhan yang bisa dimodifikasi dengan program editor teks. Sedangkan file-file konfigurasi user berada di direktori “Home” setiap user. </td></tr><tr><td>/home</td><td>Direktori “/home” berisi direktori “Home” untuk setiap user (direktori “Home” untuk setiap user memiliki path “/home/username”). Contohnya jika username saya adalah “andiahmad”, maka direktori “Home” saya memiliki path “/home/andiahmad”. Direktori ini berisi file-file user dan file-file konfigurasi spesifik untuk user bersangkutan.</td></tr><tr><td>/root</td><td>Direktori “/root” adalah direktori “Home” untuk user root atau superuser. Walaupun adalah direktori “Home”, path nya bukan di “/home/root” melainkan di “/root”. Jangan lupa kalau direktori “/root” berbeda dengan direktori “/”.</td></tr><tr><td>/run</td><td>Direktori “/run” merupakan direktori yang baru dibuat. Direktori ini menjadi standar untuk penyimpanan file-file sementara (temporary) aplikasi yang dibutuhkan saat bekerja seperti sockets dan process ID. File-file ini tidak bisa disimpan di direktori “/tmp” karena file pada “/tmp” bisa terhapus.</td></tr><tr><td>/sbin</td><td>Direktori “/sbin” mirip dengan direktori “/bin”. Direktori ini berisi program-program yang hanya bisa dijalankan dalam mode root atau superuser untuk kepentingan sistem administrasi.</td></tr><tr><td>/tmp</td><td>Direktori “/tmp” adalah direktori tempat aplikasi menyimpan file-filenya secara sementara. File-file ini akan dihapus secara otomatis setiap kali sistem melakukan reboot. Dan juga bisa dihapus kapan saja oleh user.</td></tr><tr><td>/usr</td><td>Direktori  berisi ini aplikasi dan file yang digunakan oleh user (berbeda dengan aplikasi dan file yang digunakan oleh sistem). Contohnya aplikasi yang non–essential disimpan di direktori “/usr/bin”.  Program sistem administrasi yang non-essential disimpan di direktori “/usr/sbin”. Libraries untuk setiap user berada di direktori “/usr/lib”. Dan ada beberapa subdirectory lainnya pada direktori “/usr”, seperti konfigurasi graphics seperti themes pada “/usr/share”.</td></tr> <tr><td>/var</td> <td>Direktori \"/var\" adalah direktori yang isinya terus berubah-ubah, karena direktori \"/var\" befungsi untuk menyimpan informasi pencatatan log sistem, web server, mailbox dan cache. Dan karena direktori ini berfungsi untuk menampung log file makanya direktori ini dinamakan direktori var(variable).</td></tr></table>"
    },
    {
        "key": "perintah-dasar-linux-sistem",
        "image": "../../assets/image/linux/linux-logo-sistem.png",
        "title": "Perintah untuk mengetahui informasi sistem pada Linux",
        "writter": "Andi Ahmad Yusup - 3 Jan 2022",
        "type": "image",
        "video": "",
        "detail": "Hola! Hai minna ketemu lagi nih sama mimin, gimana kabar kalian? Genki desu ka? Harus baik baik aja yea!. Btw, sekarang mimin mau bahas perintah linux mengenai sistem, mulai dari cek informasi cpu, disk, memori sampai monitoring sistem agar kita bisa melakukan maintenance ketika ada kesalahan atau proses yang berjalan abnormal di sistem operasi kita. Oke tanpa berlama-lama kita langsung cuss aja ke materi pembahasan.\n  <h4>1. Perintah untuk  mengetahui CPU</h4>\n Terdapat beberapa cara untuk melihat informasi CPU, yaitu dengan perintah <b>lscpu</b> atau dengan <b>less /proc/cpuinfo</b>. Keduanya sama sama menampilkan informasi mengenai CPU, mulai dari arsitektur CPU, jumlah CPU, tipe CPU, frekuensi CPU, dan masih banyak lagi. Namun, berbeda dengan output dari perintah <b> /proc/cpuinfo</b>, output dari <b>lscpu</b> tidak menampilkan daftar semua CPU logical. Untuk lebih lengkapnya kalian bisa lihat gambar dari <b>lscpu</b> yang kita pakai di bawah ini :\n <img src='../../assets/image/perintah-linux-v2/lscpu.png'/> \nDari output perintah <b>lscpu</b> di atas kita menemukan beberapa informasi, antara lain :\n <ul class='ul-sistem-linux'> <li>Architecture : konsep perencanaan serta struktur pengoperasian dasar dari sebuah sistem komputer (x86_64 atau i686).</li> <li>CPU op-mode(s) : menampilkan informasi apakan prossesor support 32 bit, 64 bit atau keduanya</li> <li>Byte Order : urutan byte yang digunakan oleh CPU dalam mengakses data. </li> <li>CPU(s) : menampilkan jumlah logical core yang terdapat dalam CPU. </li> <li>On-line CPU(s) : menampilkan jumlah CPU yang sedang aktif. </li> <li>Model name : model CPU yang digunakan. </li> <li>Threads(s) per core : jumlah thread yang dapat dijalankan oleh masing-masing core pada CPU. </li> <li>Core(s) per socket: jumlah core masing-masing socket pada CPU. </li> <li>Socket : jumlah socket CPU. </li> <li>CPU MHz: frekuensi clock CPU saat ini. </li> <li>BogoMIPS : menunjukkan secara relatif seberapa cepat CPU komputer bekerja. </li> <li>Flags : menampilkan <a href='https://git.kernel.org/pub/scm/linux/kernel/git/stable/linux.git/tree/arch/x86/include/asm/cpufeatures.h' target='_blanks'>fitur</a> yang didukung oleh CPU. </li> <li>L1d chache : ukuran chache data. </li> <li>L1i chache : ukuran chache intruksi. </li> <li>L2-L3 : ukuran chache L2 dan L3. </li> <li>NUMA node0 CPU(s): daftar CPU pada node 0 yang terpasang di sistem. </li> <li>NUMA node(s): jumlah node pada sistem yang menggunakan teknologi Non-Uniform Memory Access (NUMA). </li> </ul class='ul-sistem-linux'>\n  <h4>2. Perintah untuk mengetahui Memory</h4> Perintah <b>free</b> dapat digunakan untuk melihat informasi mengenai penggunaan memori pada sistem operasi unix. \n <img src='../../assets/image/perintah-linux-v2/free.png'/>\n Dari output di atas terdapat beberapa informasi. yaitu, \n <ul class='ul-sistem-linux'> <li> mem : indikator untuk memori dari RAM.</li> <li> swap : indikator untuk memori dari partisi swap.</li>  <li> total : jumlah dari semua memori yang tersedia.</li> <li> used : jumlah dari memori yang digunakan.</li> <li> free : jumlah dari memori yang tidak digunakan.</li> <li> shared : jumlah dari memori yang digunakan tmpfs(Temporary File System).</li> <li> buff/chache : jumlah memory yang digunakan untuk buffer dan cache (buff/cache). </li> </ul>\n <h4>3. Perintah untuk mengetahui Disk</h4>\n Untuk mengetahui informasi dari penggunaan disk pada sistem operasi Linux, kalian dapat menggunakan perintah <b>df</b>.  \n  Perintah <b>df</b> menampilkan beberapa kolom. Yaitu, kolom <b> Filesystem </b>yang merupakan parameter file sistem yang berisi nama perangkat atau tempat file berada, lalu kolom <b>1K-blocks </b> yang mereprensentasikan total ukuran disk dalam hitungan KB, kolom <b>Used </b>menampilkan jumlah disk yang digunakan, kolom <b>Available</b> menampilkan jumlah disk yang tersedia/tidak digunakan, kolom <b>Use%</b> menampilkan jumlah disk yang digunakan dalam bentuk persen(%), dan kolom <b>mounted on</b> menampilkan path/tempat file sistem dipasang. \n<img src='../../assets/image/perintah-linux-v2/df.png'/>\n <h4>4. Perintah untuk mengetahui utilisasi semua komponen </h4>\n Untuk melihat daftar proses yang sedang berjalan, melakukan utilisasi/utilization CPU kita bisa menggunakan perintah <b>top</b>. Perintah <b>top</b> memberikan tampilan real-time yang dinamis dari sistem yang sedang berjalan. Biasanya, perintah ini menampilkan ringkasan informasi sistem dan daftar proses atau threads yang dikelola oleh kernel linux. Di bagian atas ketika perintah <b>top</b> ini dijalankan kalian akan melihat statistik proses dan penggunaan sumber daya, sedankan bagian bagian bawah berisi daftar proses yang sedang berjalan.\n <img src='../../assets/image/perintah-linux-v2/top-1.png'/>\n <img src='../../assets/image/perintah-linux-v2/top-2.png'/>\n Dari output perintah top di atas terdapat beberapa informasi, yaitu :  \n<ul class='ul-sistem-linux'> <li>PID : menunjukan id unik dari program.</li> <li>PR : prioritas program. Semakin kecil angkanya, maka program itu semakin di prioritaskan.</li> <li>VIRT : total memori virtual yang digunakan oleh program.</li> <li>USER : username dari pemilik program.</li> <li>CPU% : merepresentasikan penggunaan CPU dalam bentuk persen(%).</li> <li>TIME+ : waktu CPU, sama seperti \"TIME\", tetapi lebih rinci hingga menampilkan waktu sampai seperseratus (1/100) detik. </li> <li>SHR : merepresentasikan Shared Memory dalam bentuk kb, yang digunakan oleh program.</li> <li>NI : merepresenttasikan Nice Value dari program. Nice Value negatif berarti prioritas lebih tinggi, dan Nice Value positif berarti prioritas lebih rendah.</li> <li>%MEM : Menunjukan jumlah memori yang digunakan oleh program dalam bentuk persen(%).</li> <li>RES : Berapa banyak RAM fisik yang digunakan proses, diukur dalam kilobyte. </li> <li>COMMAND : nama dari perintah yang menjalankan program</li> </ul> "
    },
    {
        "key": "perintah-dasar-linux-page-3",
        "image": "../../assets/image/linux/linux-logo.jpg",
        "title": "Perintah dasar Linux (III)",
        "writter": "Andi Ahmad Yusup - 31 Des 2022",
        "type": "image",
        "video": "",
        "detail": "<h4>12. comm</h4>\ncomm adalah perintah yang berfungsi untuk membandingkan dua file yang telah terurut baris demi baris (sort terlebih dahulu kedua file yang akan dibandingkan). Misalnya, disini kita buat dua file yang sudah ter-sort \n <img src='../../assets/image/perintah-linux/comm-1.png'/>\n <b>a. comm -1 file1 file2</b>\nDengan menggunakan opsi -1 maka kita akan mendapatkan output yaitu dua field, field pertama adalah item yang tidak terdapat pada file1, sedangkan field kedua adalah item yang terdapat pada kedua file \n <img src='../../assets/image/perintah-linux/comm-2.png'/>\n<b>b. comm -2 file1 file2</b>\n Dengan menggunakan option -2 kita juga akan mendapatkan output 2 field, field yang pertama berisi item yang tidak terdapat pada file2, dan field kedua berisi item yang terdapat pada kedua file tersebut\n <img src='../../assets/image/perintah-linux/comm-3.png'/>\n<b>c. comm -3 file1 file2</b>\n Sedangkan dengan opsi -3, pada field pertama akan menampilkan item yang tidak terdapat pada file2, dan field kedua akan menampilkan item yang tidak terdapat pada file1\n <img src='../../assets/image/perintah-linux/comm-4.png'/>\n<b>d. comm -12 file1 file2</b>\nDengan menggunakan opsi -12 kita hanya akan mendapatkan 1 field, dimana field ini berisi item yang terdapat pada file1 dan file2\n<img src='../../assets/image/perintah-linux/comm-5.png'/>\n<b>e. comm -13 file1 file2</b>\n Opsi -13 tidak hanya akan menampilkan item yang tidak terdapat pada file1\n<img src='../../assets/image/perintah-linux/comm-6.png'/>\n<b>f. comm -23 file1 file2</b>\nDan dengan opsi -23 kita akan mendapatkan item yang tidak terdapat pada file2\n<h4>13. For dan While</h4>\nPerintah for atau while berfungsi untuk looping pada unix atau linux, tapi perintah di atas ini biasanya di save pada sebuah file program ber-ekstensi \".ksh\" atau \".sh\".\n Contoh untuk for : \n Tuliskan kode di bawah, dan simpan pada file dengan format \"sh\" atau \"ksh\"\n <div class='code'>for var in 0 1 2 3 4 5 6 7 8 9 <br/>do <br/> &nbsp; echo $var<br/> done</div>\n <img src='../../assets/image/perintah-linux/loop-1.png'/>\n<img src='../../assets/image/perintah-linux/loop-2.png'/>\nTapi ingat, untuk menjalankan file ber-ekstensi \"ksh\" atau \"sh\" ini kita harus memberikan hak akses. Gunakan perintah ls –lrt kita akan mendapatkan info seperti ini di depan \"-rw-r--r--\" artinya belum dapat hak akses untuk di eksekusi perintah tersebut. Gunakan <b>chmod 777 latihan1.sh</b> kemudian cek kembali dengan perintah ls –lrt sekarang info didepan sudah berubah menjadi \"-rwxrwxrwx\" artinya file tersebut dapat di jalankan.\n <img src='../../assets/image/perintah-linux/loop-3.png'/>\n Selain dengan cara tersebut, kita juga bisa menuliskan for dengan cara seperti ini : \n <div class='code'>for((i = 0; i <= 10; i++)); <br/>do <br/> &nbsp; echo $i<br/> done</div><br/>Disini kita memberikan kondisi pada perulangan for nya \"(i = 0; i <= 10; i++)\". Terdapat 3 field pada perulangan for, dipisahkan oleh titik koma \";\", field pertama untuk memberikan nilai awal, field 2 menentukan kondisi, dan field 3 hal apa yang akan kita lakukan jika kondisi nya terpenuhi. disini kita menentukan nilai awalnya = 0, lalu memberikan kondisi jika variable i kurang dari samadengan 10, maka variable i ini akan ditambah 1 (perintah i++ pada field 3). lalu pada bagian \"do\" adalah apa yang akan kita lakukan jika perulangannya terpenuhi. Di sini kita akan menampilkan nilai variable i pada saat perulangannya dijalankan (echo $i), dan variable i ini akan terus ditampilkan hingga kondisi perulangan tidak terpenuhi (tidak terpenuhi jika i lebih dari 10, karena kondisinya adalah i kurang dari samadengan 10), dan \"done\" adalah closing syntax dari perulangan for ini. \n Hasil outputnya akan terlihat seperti ini : \n<img src='../../assets/image/perintah-linux/loop-4.png'/>\n Contoh untuk while : \n <div class='code'>#!bin/sh\na=0\nwhile [ $a -lt 10 ] <br/> do <br/> &nbsp; echo $a <br/> &nbsp; a=`expr $a + 1` <br/> done</div><br/> Sama seperti perulangan for, hanya saja di while ini hanya memiliki 1 field, yaitu untuk menentukan kondisi. Menentukan nilai awal diberikan diluar perulangan while, dan untuk menambah nilai dilakukan sebelum syntax while ditutup (setelah melakukan action yang di inginkan). Misalnya disini kita menentukan nilai variable a = 0, dan kondisi dalam perulangan while nya ([$a -lt 10]) artinya jika variable a \"-lt\" (lower than/kurang dari) 10, maka akan menjalankan perintah di dalam scope \"do\" dan \"done\". Di dalam scopenya kita menjalankan perintah \"echo $a\" untuk menampilkan nilai variable a ke terminal saat perulangannya dijalankan, dan \"a=`expr $a + 1` \" untuk menambah nilai variable a agar kondisi while nya tidak terpenuhi, jika ini tidak dilakukan maka akan terjadi infinity loop. \n Hasil outputnya akan seperti ini : \n<img src='../../assets/image/perintah-linux/loop-6.png'/><br/>\n Yaps, itulah beberapa perintah dasar linux yang wajib kita ketahui jika ingin menjadi seorang System Administrator. Never gonna give you up, always learning and learning!\n\n\n<div class='btn-wrapper'><a href='perintah-dasar-linux-page-2' class='btn btn-last'>Sebelumnya</a></div>"
    },
    {
        "key": "perintah-dasar-linux-page-2",
        "image": "../../assets/image/linux/linux-logo.jpg",
        "title": "Perintah dasar Linux (II)",
        "writter": "Andi Ahmad Yusup - 31 Des 2022",
        "type": "image",
        "video": "",
        "detail": "<h4>10. Membuka isi File</h4>\n Kita dapat menggunakan perintah <b>more [nama file]</b> atau <b>cat [nama file]</b> untuk melihati isi file. Pertama - tama buatlah dua file \"data1 dan data2\" dengan perintah \"vi\" dan save. \n Isi file \"data1\" dengan text ini : \n<div class='code'>andi|90<br/>ahmad|99<br/>yusup|2</div>\n Isi file \"data2\" dengan text ini : \n<div class='code'>kaori|100<br/>kobo|3<br/>raphtalia|92</div>\n Setelah membuat kedua file itu, kita coba menampilkan file \"data1\" dengan perintah <b>\"cat data1 / more data1\"\n</b><img src='../../assets/image/perintah-linux/cat-more.png'/>\n Kedua perintah tersebut menampilkan hasil yang sama persis. Selain untuk menampilkan isi dari file, kedua perintah diatas juga dapat kita gunakan untuk dua file menjadi satu file dengan menggunakan operator tambahan yaitu \">\".\n<img src='../../assets/image/perintah-linux/cat-more-2.png'/>\n<img src='../../assets/image/perintah-linux/cat-more-3.png'/>\n<h4>11. Fungsi grep, sort, uniq, cut, pipeline dan awk</h4>\nSedikit penjelas tentang pipeline adalah lambang/operator yang memisakan dua perintah yang berbeda. Contoh : cat data3 | grep “amri” dari perintah di samping cat dan grep adalah dua buah perintah yang berbeda di pisahkan oleh pipeline. Dan dibawah nanti akan lebih banyak lagi fungsi dari pipeline tersebut.\n<b> a. grep / egrep</b>\n \"grep\" digunakan untuk memfilter isi dari file. Berikut adalah salah satu contoh penggunaan perintah \"grep\" : \n <img src='../../assets/image/perintah-linux/grep.png'/><br/> Sedangkan \"egrep\" digunakan untuk melakukan tugas multi-filtering.\n<img src='../../assets/image/perintah-linux/egrep.png'/>\n<b>b. sort</b>\nSort adalah perintah untuk mengurutkan abjad atau nomer. Misalnya kita lihat isi dari file data3 yang tidak terurut\n<img src='../../assets/image/perintah-linux/sort-1.png'/><br/>Untuk mengurutkannya kita bisa menggunakan perintah <b>cat data3 | sort</b>\n<img src='../../assets/image/perintah-linux/sort-2.png'/> <br/> Jika kita ingin menyimpan isi yang telah di urutkan ini ke file lain, kita bisa menggunakan operator \">\" seperti sebelumnya\n<img src='../../assets/image/perintah-linux/sort-3.png'/>\n<b>c. uniq</b>\nuniq digunakan untuk memfilter informasi yang ter-duplikat. Misalnya, kita coba gabungkan dua file \"data3\" dan \"data4\"\n<img src='../../assets/image/perintah-linux/uniq-1.png'/><br/>Pada file \"data5\" telah terdapat informasi dari gabungan data3 dan data4, namun dengan informasi yang ter-duplikat. Untuk menghilangkan informasi yang ter-duplikat ini kita bisa menggunakan perintah <b>uniq</b>. Namun, untuk menggunakan perintah \"uniq\", informasi dalam filenya harus ter \"sort\" terlebih dahulu.\n Hasil sort tanpa uniq :\n<img src='../../assets/image/perintah-linux/uniq-2.png'/><br/>Hasil sort dengan uniq : \n<img src='../../assets/image/perintah-linux/uniq-3.png'/><br/>Untuk melihat jumlah informasi yang ter-duplikat, kita bisa menambahkan option \"-c\" pada perintah uniq.\n<img src='../../assets/image/perintah-linux/uniq-4.png'/>\n<b>d. cut</b>\nPerintah cut adalah perintah yang digunakan untuk mengambil kolom tertentu dari baris-baris masukannya, yang ditentukan pada option \"–c\"<br/>Misalnya, kita ambil contoh dari file yang baru lagi “contoh1” (buat lah dengan perintah vi) dengan isi :\n <div class='code'>Belajar membaca dan menggambar manga</div>\n<img src='../../assets/image/perintah-linux/cut-1.png'/><br/>Pada file “contoh1” ini akan kita gunakan untuk perintah <b>cut -c1-7</b>, untuk mengambil kata dari range huruf 1 - 7 (dalam perintah cut ini [spasi] juga dihitung)\n<img src='../../assets/image/perintah-linux/cut-2.png'/>\n <b>e. awk</b>\n awk adalah perintah yang sungguh power full (banyak kegunaannya) dari menghitung sampai memanipulasi sebuah infromasi. Misalnya, disini kita buat file baru dengan nama \"contoh2\" dan isinya : \n <div class='code'>nama|nilai|status<br/>ahmad|99|jomblo<br/>andi|90|pacar kaori<br/>kaori|100|pacar andi<br/>kobo|3|duda<br/>raphtalia|92|jomblo<br/>yusup|2|jomblo</div>\n<img src='../../assets/image/perintah-linux/awk-5.png'/><br/>Nah, disini kita gunakan perintah awk seperti ini <b>cat contoh2 | awk –F \"|\" {print $3}</b>\n <img src='../../assets/image/perintah-linux/awk-6.png'/><br/> maka outputnya hanya akan menampilkan field bagian \"status\" karena field yang kita print/panggil adalah \"$3\" (tiap field  dipisahkan oleh delimiter \"|\")\n Untuk case lainnya, misalkan disini kita akan mencoba menampilkan field 1 dan 3, maka perintah awk yang kita gunakan adalah <b>cat contoh2 | awk -F \"|\" '{print $1 \"|\" $3}'</b>\n <img src='../../assets/image/perintah-linux/awk-7.png'/> \n\n\n<div class='btn-wrapper'><a class='btn btn-back' href='perintah-dasar-linux'>Sebelumnya</a>  <a class='btn btn-next' href='perintah-dasar-linux-page-3'>Selanjutnya</a></div> "
    },
    {
        "key": "perintah-dasar-linux",
        "image": "../../assets/image/linux/linux-logo.jpg",
        "title": "Perintah dasar Linux",
        "writter": "Andi Ahmad Yusup - 31 Des 2022",
        "type": "image",
        "video": "",
        "detail": "Halo temen - temen, kali ini mimin mau bahas perintah dasar linux lohh. Tapii, sebelum kita masuk ke pembahasan perintah dasar linux, temen temen udah tau belum apa itu linux?\n Jadi, Secara sederhana, Linux adalah sistem operasi atau Operating System (OS), sama seperti Windows OS, MacOS, iOS, Android, dan sebagainya. Seperti sistem operasi umumnya, fungsi Linux adalah sebagai wadah untuk menjembatani komunikasi atau perintah pengguna pada hubungan software dan hardware dalam sebuah perangkat.\n Sekarang temen - temen udah tahu kan apa itu linux? kalau sudah kita langsung cuss ke perintah - perintah Linux! \n Berikut adalah perintah - perintah Linux yang akan kita bahas : \n<h4>1. Membuat Folder/Direktori</h4> \n Untuk membuat folder temen - temen dapat menggunakan perintah <strong>mkdir [nama folder]</strong>, misalnya ketika temen - temen ingin membuat folder \"belajar\" maka temen temen bisa menuliskan perintah seperti berikut\n <img src='../../assets/image/perintah-linux/mkdir.png'/> Lalu, untuk melihat hasilnya temen - temen dapat menggunakan perintah <strong>ls -lrt</strong> \n <img src='../../assets/image/perintah-linux/dir-show.png'/> \n <h4>2. Membuat file</h4>\n Untuk membuat file terdapat beberapa cara, antara lain : \n <strong>1. Touch</strong> </br>dengan menggunakan perintah touch kita dapat membuat file secara langsung, tanpa menampilkan editornya\n<img src='../../assets/image/perintah-linux/touch.png'/>\n<strong>2. vi</strong>\nSedangkan vi digunakan untuk membuat file dengan menampilkan editornya. kita dapat menggunakan perintah <strong>vi [nama file]</strong>. Setelah mengeksekusi perintah ini, kita akan ditampilkan sebuah editor. Untuk dapat menulis di editor vi ini dapat dilakukan dengan menekan huruf <b>\"i\"</b> pada keyboard. \n<img src='../../assets/image/perintah-linux/vi.png'/> Setelah selesai menulis kita hanya perlu menekan tombol <b>\"esc\"</b> pada keyboard lalu tekan tombol <b>\"shift + :\"</b></br>ketik <b>\"wq\"</b> untuk keluar dan menyimpan file yang kita buat atau <b>\"q!\"</b> untuk keluar tanpa menyimpan file yang kita buat \n <img src='../../assets/image/perintah-linux/vi-wq.png'/>\n<img src='../../assets/image/perintah-linux/vi-q.png'/>\n<img src='../../assets/image/perintah-linux/vi-saved.png'/>\n <h4>3. Menghapus File</h4>\nUntuk menghapus file kita bisa menggunakan perintah <b>rm [nama file]</b>\n<img src='../../assets/image/perintah-linux/rm-file.png'/>\n<h4>4. Menghapus Folder/Direktori</h4>\n Ketika kita ingin menghapus sebuah direktori, maka kita dapat menggunakan perintah <b>rm -rf [nama direktori]</b> atau <b>rmdir [nama direktori]</b>.\n<img src='../../assets/image/perintah-linux/rm-dir.png'/>\n <h4>5. Memindahkan atau me-rename File/Direktori</h4>\n Memindahkan file dapat menggunakan perintah <b>mv [file] [posisi tujuan]</b>, misalnya, kita akan memindahkan \"file2\" ke dalam direktori \"belajar\" yang telah kita buat.\n<img src='../../assets/image/perintah-linux/mv-1.png'/><br/>Untuk melihat isi dari direktori \"belajar\" kita dapat menggunakan perintah <b>ls -lrt belajar</b>\n<img src='../../assets/image/perintah-linux/mv-2.png'/>\nIsi pada direktori \"belajar\" terdapat \"file2\". <br/> Begitu juga dengan cara memindahkan <b>direktori ke direktori</b> lain.\nSedangkan untuk me-rename file/direktori kita dapat menggunakan perintah <b>mv [nama file] [nama file baru]</b>\n<img src='../../assets/image/perintah-linux/mv-3.png'/>\n <h4>6. Copy File/Direktori</h4>\nUntuk me-copy file kita dapat menggunakan perintah <b>cp [nama file] [nama file baru]</b>. Misalnya disini kita me-copy file \"coba2\" dengan nama lain menjadi \"test2\"\n<img src='../../assets/image/perintah-linux/cp-1.png'/>\n Sedangkan untuk me-copy direktori kita memerlukan perintah <b>cp -r [nama direktori] [nama direktori baru]</b>\n<img src='../../assets/image/perintah-linux/cp-2.png'/>\n<h4> 8. Mencari tahu posisi aktif sekarang</h4>\nUntuk mengetahui posisi aktif kita sekarang, kita hanya perlu menjalankan perintah <b>pwd</b>\n<img src='../../assets/image/perintah-linux/pwd.png'/>\n<h4>9. Melihat isi folder</h4>\n Jika kita ingin melihat isi folder kita dapat menggunakan perintah <b>ls / ls -lrt</b>. Untuk cara penggunaan dan contohnya telah kita lakukan pada perintah - perintah di atas.\n\n\n<div class='btn-wrapper'><span></span><a class='btn btn-next' href='perintah-dasar-linux-page-2'>Selanjutnya</a></div>"
    },
    {
        "key": "langkah-merakit-pc",
        "image": "../../assets/image/merakit-pc/pc.jpg",
        "title": "Langkah - Langkah Merakit PC",
        "writter": "Andi Ahmad Yusup - 14 Des 2022",
        "type": "video",
        "video": "https://www.youtube.com/embed/CoHGwzxUtfo",
        "detail": "<h4>Hal yang perlu disiapkan :</h4> \n <ol class='merakit-pc'><li>Obeng besar dan obeng kecil</li> <li>Gelang listrik statis (Untuk keselamatan kerja)</li>   <li>Tempat untuk menyimpan baut agar tidak berceceran</li> <li>Kabel Ties (Opsional)</li></ol class'merakit-pc'>\n<h4>Penjelasan dan fungsi komponen yang akan digunakan :</h4>\n <h5>1. Casing PC</h5>\n <img src='../../assets/image/merakit-pc/case.png'/>\n Casing pc adalah sebuah tempat untuk menyimpan sebagian besar komponen pada komputer. Casing pc ini biasanya dibuat dari bahan baja atau aluminium. Casing PC berfungsi untuk melindungi komponen yang ada dalam komputer. Casing pc juga bisa disebut sebagai rumah dari hardware komputer, hard disk, DVD rom serta perangkat komputer yang lainnya. Jika tidak ada casing pc ini maka perangkat seperti prosesor dalam komputer akan rentan terhadap debu, asap, kotoran serta hal-hal lainnya yang dapat merusak perangkat lainnya dalam komputer.\n <h5>2. Motherboard</h5> \n<img src='../../assets/image/merakit-pc/motherboard.png'/>\nMotherboard adalah perangkat keras yang menjadi jantung dari sebuah komputer. Ia menyatukan setiap keping komponen komputer agar menjadi mesin yang utuh dan dapat bekerja secara maksimal. Fungsi motherboard yaitu untuk menyediakan tata letak terbaik, karena semua komponen pemrosesan yang penting dari komputer, seperti Central Processing Unit (CPU), memori sistem (RAM) dan kartu grafis, tertanam di motherboard. Dan, motherboard menghubungkan semua komponen ini. Ini dikenal sebagai Hub Komponen.\nMotherboard memiliki papan sirkuit, dan pada papan sirkuit ini dirancang dengan jalur yang berbeda, yang dikenal sebagai buses. Fungsi motherboard melalui jalur tersebut berguna untuk mentransfer data ke semua komponen komputer.\nMotherboard juga berfungsi untuk mengatur dalam mengedarkan daya untuk bagian-bagian komputer sesuai dengan kebutuhan setiap bagian.\n <h5>3. Processor/CPU</h5> \n <img src='../../assets/image/merakit-pc/cpu.png'/>\nCPU atau central processing unit adalah pusat kendali komputer. CPU merupakan rangkaian sirkuit elektronik yang sangat kompleks dan luas yang menjalankan instruksi program yang tersimpan. Fungsi utama dari CPU adalah melakukan operasi aritmatika dan logika terhadap data yang diambil dari memori atau dari informasi yang dimasukkan melalui beberapa perangkat keras, seperti papan ketik, pemindai, tuas kontrol, maupun tetikus. CPU dikontrol menggunakan sekumpulan instruksi perangkat lunak komputer.\n<h5>4. RAM</h5>\n<img src='../../assets/image/merakit-pc/ram.png'/>\n4. RAM RAM atau Random Access Memory adalah hardware yang terdapat pada perangkat untuk menyimpan data. RAM berfungsi sebagai penyimpan memori sementara. Fungsi ini merupakan fungsi RAM yang paling utama. Memori yang ada pada RAM kemudian akan diteruskan menuju CPU untuk diproses informasi dari aplikasi maupun program yang ada dan kamu simpan di dalam RAM.\n<h5>5. SSD</h5> \n <img src='../../assets/image/merakit-pc/ssd.png'/>\nSolid-state drive (SSD) adalah perangkat penyimpanan generasi baru yang digunakan di komputer. SSD menggantikan hard disk mekanis tradisional dengan menggunakan memori berbasis flash, yang secara signifikan lebih cepat. SSD memiliki fungsi untuk menjalankan sistem laptop atau komputer, menyimpan berbagai aplikasi, dan menyimpan dokumen-dokumen/file- file personal.\n <h5>6. Heatsink/CPU Fan</h5>\n<img src='../../assets/image/merakit-pc/heatsink.png'/>\nHeatsink adalah sebuah logam (terbuat dari aluminium atau tembaga) yang menempel di atas sebuah prossesor melalui perantara krim yang disebut dengan thermal grease. Heatsink ini bisa anda temukan terpasang diatas processor (CPU), di atas chip VGA card (GPU), dan juga bisa anda temukan pada jenis RAM kelas high-end.\nHeatsink berfungsi untuk menyebarkan panas yang dihasilkan oleh prosessor yang ada di bawahnya ke udara di sekitarnya, Singkat kata.. fungsinya adalah untuk mendinginkan prosessor.\nCPU Fan adalah sebuah kipas yang terdapat di dalam casing komputer, CPU Fan ini ada yang menempel di casing ada juga yang menempel di atas heatsink. Fungsi CPU Fan adalah untuk mendinginkan heatsink tersebut, sedangkan fungsi CPU Fan yang menempel di casing adalah untuk mengatur aliran udara (air flow) di dalam casing supaya tetap dingin, jadi udara segar dari luar ditarik ke dalam dan udara panas dari dalam dikeluarkan.\n <h5>7. VGA</h5> \n <img src='../../assets/image/merakit-pc/vga.png'/>\nVGA adalah singkatan dari Video Graphic Array atau sebuah tipe standar koneksi yang sangat penting pada perangkat video maupun gambar seperti monitor dan proyektor. Umumnya, VGA berbentuk kabel, port, dan konektor yang digunakan untuk menghubungkan monitor ke kartu video. Fungsi VGA adalah memproduksi dan menampilkan gambar pada display monitor. Pada komputer versi lama, VGA ini adalah komponen yang sangat penting. Namun, untuk komputer dengan spesifikasi terbaru, fungsi dianggap tidak penting karena biasanya sudah ada pada motherboard (VGA card onboard). \n  <h5>8. PSU(Power Supply)</h5>\n <img src='../../assets/image/merakit-pc/psu.png'/>\n Power supply adalah salah satu komponen perangkat keras yang berperan sebagai penyedia listrik dan daya yang digunakan untuk menyalakan komputer dan perangkat lainnya. Powes Supply berfungsi untuk mengubah arus tegangan listrik agar tidak melebihi batas maksimal perangkat. Menjadi daya cadangan dalam bentuk baterai. Contoh dari fungsi ini adalah UPS yang dibuat untuk mencegah listrik mati mendadak saat supply energi terhenti.\n  <h5>9. Thermal Paste</h5> \n <img src='../../assets/image/merakit-pc/thermal-paste.png'/>\nThermal Paste adalah pasta yang memiliki daya hantar panas sangat baik, sehingga panas yang dihasilkan komponen akan cepat terbuang keluar. Karena itu, pasta ini juga sering disebut dengan pasta pendingin.\n\n<h4>Langkah – Langkah merakit PC :</h4>\n<h5>1. Pasang Prossesor ke Motherboard</h5> Ambil Motherboard, lalu lepas penutup Prosessor dan pasang Prosessor pada socketnya. Sebelum memasang prosesor harap perhatikan titik – titik yang ada di sekitar atau pinggi Prossesor agar ketika prosessor dipasang dapat masuk dengan tepat.\n<h5>2. Pasang RAM ke Motherboard</h5>Masukan RAM ke slot RAM yang tersedia, kemudian tekat sedikit hingga berbunyi “klik”. Setelah itu, tutup kunci RAM dengan hati – hati \n<h5>3. Pasang Heatsink</h5>Sebelum memasang Heatsink jangan lupa untuk sedikit mengaplikasikan Thermal Paste di atas Prossesor , setelah itu pasangkan Heatsink ke Motherboard (di atas CPU), dan pasang kabel CPU Fan ke CPU Fan Socket yang ada di Motherboard \n<h5>4. Pasang Motherboard ke dalam Casing PC</h5>  Ambil obeng, lalu lepas baut yang masih terpasang di Casing PC. Setelah itu, buka penutup Casing PC dan pasang Motherboard ke dalam slotnya yang tersedia di Casing PC       \n<h5>5. Pasang VGA</h5>   Buka bagian pinggiran Casing PC. Lalu, pasang VGA di atas Motherboard dengan posisi berdiri, usahakan pas dengan bagian pinggiran Casing PC\n<h5></h5> \n<h5>6. Pasang SSD</h5>Ambil SSD lalu pasang ke dalam Casing PC, dan hubungkan SSD ke port SATA yang ada di Motherboard menggunakan kabel SATA \n<h5>7. Pasang PSU</h5>Masukan PSU ke dalam casing PC, kemudian rapihkan kabelnya ke bagian luar casing sebelum ditempatkan pada portnya masing masing. \n<h5>8. Pasang Kabel PSU</h5> Ambil main kabel dari PSU (biasanya kabel yang memiliki ukuran paling besar) lalu masukan ke portnya. Setelah itu, ambil kabel pipih dari PSU lalu masukan ke port SATA. Terakhir, ambil kabel dari PSU yang memiliki 4 Pin, lalu masukan ke port CPU Power yang ada di Motherboard ( Untuk mengalirkan listrik dari PSU ke CPU).\n<h5>9. Pasang Kabel Front Panel</h5> Ambil kabel Front Panel kemudian pasang Front Panel ke Motherboard sesuai portnya yang tersedia. Tiap tipe Motherboard memiliki Front Panel yang berbeda, untuk itu lihat panduan pemasangan Front Panel di Internet sesuai merek dan Motherboard yang anda gunakan.   \n<h5>10. Finishing</h5>Setelah semua komponen terpasang dengan baik (tidak longgar) silahkan tutup kembali Casing PC dan kencangkan bautnya. Lalu Personal Computer siap digunakan       "
    },
    {
        "key": "sejarah-linux",
        "image": "../../assets/image/linux/linux-pc.jpg",
        "title": "Sejarah Linux",
        "writter": "Andi Ahmad Yusup - 21 Des 2022",
        "type": "image",
        "video": "https://www.youtube.com/embed/CoHGwzxUtfo",
        "detail": "Linux adalah nama yang diberikan pada sistem operasi komputer bertipe Unix dengan logonya berupa seekor burung Pinguin. Linux mempunyai kemampuan MultiTasking, Multi User, dan Memory Management yang baik. Nama \"Linux\" berasal dari nama pembuatnya, yang diperkenalkan tahun 1991 oleh Linus Torvalds, seorang mahasiswa asal Finlandia yang dilahirkan pada tanggal 28 Desember 1969. Orang yang disebut- sebut sebagai bapak Linux ini, sudah mengenal bahasa pemrograman pada umur 10 tahun. Karena hobinya dalam dunia computing, di tahun 1988 Linus diterima di University of Helsinki dan pada tahun 1990 Linus mulai belajar kelas pemrograman C pertamanya.\n Linus tidak puas terhadap sistem operasi yang ada pada PC pertamanya (MS-DOS atau Disk Operating Sistem), OS buatan Microsoft. Linus lebih cenderung untuk menggunakan sistem operasi bertipe Unix seperti yang dipakai pada komputer milik Universitasnya. Linux adalah sebuah kernel sistem operasi. Pada mulanya, kernel yang dibuat berbasis Minix, sebuah sistem operasi kecil yang dibuat oleh Prof. Andrew Tanenbaum pada tahun 1987, yang banyak digunakan mata kuliah sistem operasi. Sampai saat ini, Minix masih tetap ada, dan masih tetap sederhana karena tujuannya memang untuk praktik kuliah.\n Pada tahun 1969, Ken Thompson dan Dennis Ritchie (juga adalah developer bahasa C), para peneliti di AT&T Bell Laboratorium Amerika, membuat sistem operasi Unix, cikal bakal dari Linux. Unix mendapatkan perhatian besar karena merupakan sistem operasi pertama yang dibuat bukan oleh hardware maker. Selain itu juga karena seluruh source code-nya dibuat dengan bahasa C, sehingga mempermudah pemindahannya ke berbagai platform. Dalam waktu singkat Unix berkembang secara pesat dan terpecah dalam dua aliran. Yaitu Unix yang dikembangkan oleh Universitas Berkeley dan yang dikembangkan oleh AT&T. Setelah itu mulai banyak perusahaan yang melibatkan diri, dan terjadilah persaingan yang melibatkan banyak perusahaan untuk memegang kontrol dalam bidang sistem operasi. Persaingan ini menyebabkan perlu adanya standarisasi. \nDari sini lahirlah proyek Posix yang dimotori oleh IEEE (The Institute of Electrical and Electronics Engineers) yang bertujuan untuk menetapkan spesifikasi standar Unix. Akan tetapi, standarisasi ini tidak meredakan persaingan. Sejak saat itu, muncul berbagai macam jenis Unix. Salah satu diantaranya adalah Minix yang dibuat oleh A. S. Tanenbaum untuk tujuan pendidikan. Source code Minix inilah yang oleh Linus Torvalds, seorang mahasiswa Universitas Helsinki pada waktu itu, kemudian dijadikan sebagai referensi untuk membuat sistem operasi baru yang gratis dan yang source codenya bisa diakses oleh umum. Sistem operasi ini kemudian diberi nama Linux.\n Dalam membangun Linux, Linus menggunakan tool-tool dari Free Foundation Software yang berlisensi GNU. Kemudian untuk menjadikan Linux sebuah sistem operasi yang utuh, dia memasukkan program-program yang juga berlisensi GNU. Awalnya Linus membuat Linux sendiri sebagai hobi, karena ia ingin menjalankan sistem operasi semacam Unix dalam komputer 386-nya. Dari hasil kerjanya lahirlah Linux versi 0.01, yang sebenarnya masih belum bisa disebut sebuah sistem operasi.\nSetelah mengalami perbaikan, jadilah Linux versi 0.02, yang notabene adalah Linux resmi versi pertama yang diumumkan pada publik. Linus mengumumkan source code Linux pada tanggal 5 Oktober 1991. Saat itu Linux sudah dapat menjalankan shell bash, gcc compiler, GNU make, GNU sed, compress dll. Proyek Linux ini mendapatkan perhatian dari para programer di seluruh dunia yang kemudian turut berpartisipasi membangun Linux. \nPerkembangan Linux berlangsung dengan sangat pesat hingga saat ini. Saat ini hanya pembangunan kernel Linux saja yang masih dikontrol oleh Linus sendiri. Sedangkan bagian lain dari sistem operasi Linux telah dikembangkan oleh banyak pihak. Oleh karenanya sekarang kita dapat melihat berbagai macam distro (distribusi, jenis) Linux yang jumlahnya ratusan jenis. Salah satu distro yang terkenal adalah RedHat. Selain itu ada juga distribusi Slackware dan Debian yang memiliki ciri khasnya masing-masing. Linux juga diadaptasi ke banyak bahasa seperti misalnya Linux Trustix Merdeka di Indonesia, Vine Linux di Jepang, RedFlag Linux di Cina, dll.Perkembangan yang pesat ini tidak terlepas dari jasa proyek GNU yang menyediakan program-program bermutu yang gratis dan esensial dalam Linux, seperti shell program, compiler, XFree, Gnomedesktop, dll. Boleh dikatakan Linux ada saat ini berkat budaya open source dan fenomena Linux inipula salah satu bukti kehebatan dari budaya open source."
    }
]