[
    {
        "key" : "bill-gates",
        "image" : "../../assets/image/8-des-2022/bill-gates.jpg",
        "title" : "William Henry Gates III",
        "detail" : "Gates lahir di Seattle, Washington, dari pasangan William H. Gates dan Sr.Mary Maxwell Gates. Ia memiliki darah Inggris, jerman, Skotlandia, dan Irlandia. Keluarganya termasuk masyarakat menengah ke atas. Ibunya menjabat sebagai anggota dewan direktur First Interstate BancSystem dan United Way, dan ayahnya, J. W. Maxwell, adalah presiden bank nasional. Gates memiliki seorang kakak bernama Kristianne dan seorang adik bernama Libby. Ia merupakan keturunan keempat dalam keluarganya, namun dikenal sebagai William Gates III atau \"Trey\" karena ayahnya menyandang akhiran \"II\". \nGates tertarik dengan komputer sejak saat ia masih berusia belia. Perkenalannya dengan komputer terjadi ketika ia berusia 13 tahun. Saat itu, Mothers Club di sekolahnya, Lakeside School, membeli sebuah terminal Teletype Model 33 ASR dan beberapa komputer General Electric (GE) untuk para siswa. Melihat komputer tersebut, Gates tertarik dan mulai mempelajarinya. Ia tertarik dengan kemampuan mesin tersebut mengeksekusi kode perangkat lunak dengan sempurna dan menulis program komputer pertamanya di sini menggunakan bahasa pemrograman BASIC. Ketika ia mengenang kembali masa-masa itu, ia mengatakan, \"Ada sesuatu yang pas dengan mesin tersebut.\"Dari sana, ia mempelajari sistem lain, termasuk sistem minikomputer DEC PDP, khususnya PDP-10 yang dimiliki oleh Computer Center Corporation (CCC). Penggunaan komputer PDP-10 ini dibatasi waktu. Gates bersama beberapa temannya seperti Paul Allen, Ric Welland, dan Kent Evans, memutuskan untuk mengeksploitasi sebuah bug pada sistem operasi untuk memperoleh waktu tambahan penggunaan computer. Namun mereka tertangkap tangan dan akhirnya dilarang oleh CCC untuk mengakses sistem itu selama musim panas.\n Menjelang akhir masa hukuman, keempatnya malah ditawarkan untuk menemukan bug lain di perangkat lunak CCC dengan imbalan waktu tambahan untuk penggunaan komputer. Di kantor CCC inilah Gates mempelajari kode sumber berbagai program, termasuk program yang ditulis dalam bahasa FORTRAN dan LISP. Ia dan kawannya bekerja di sana hingga tahun 1970 ketika CCC ditutup karena bangkrut.\nPada tahun berikutnya, Information Sciences, Inc. mempekerjakan empat siswa Lakeside tersebut untuk menulis program pembayaran gaji dalam bahasa COBOL dan memberikan royalti untuk penjualan program tersebut sebagai tambahan hak akses ke komputer perusahaan. Gates juga mendapat pekerjaan tambahan ketika sekolah memintanya untuk membuat program pengatur jadwal kelas siswa. Gates memanfaatkan ini dengan mengubah sebagian program agar ia ditempatkan di kelas yang didominasi perempuan. Pada usia 17 tahun, Gates dan Allen mendirikan Traf-O-Data yang fokus pada sistem penghitung lalu lintas yang berbasis prosesor Intel 8008.\nGates lulus dari Lakeside School pada tahun 1973. Setelah itu ia mengambil tes SAT dan mendapatkan skor yang sangat tinggi, yaitu 1590 dari 1600. Dengan nilai itu, ia diterima di Harvard College di mana ia bertemu dengan Steve Ballmer yang kelak menggantikan Gates sebagai CEO Microsoft. Pada tahun keduanya di Harvard, Gates merancang sebuah algoritme untuk penyortiran panekuk sebagai solusi atas satu dari serangkaian masalah yang belum terpecahkan dalam kelas kombinatorika oleh Harry Lewis, salah seorang profesornya. Solusi Gates memegang rekor sebagai versi tercepat selama 30 tahun, penggantinya justru lebih cepat satu persen saja. Solusinya kemudian diresmikan dalam bentuk cetakan bekerja sama dengan ilmuwan komputer Harvard, Christos Papadimtriou.\nGates tidak punya rencana belajar tetap ketika menjadi mahasiswa di Harvard dan menghabiskan banyak waktunya dengan menggunakan komputer sekolah. Gates masih berkomunikasi dengan Paul Allen, dan ia bergabung dengannya di Honeywell pada musim panas 1974. Pada tahun berikutnya, MITS Altair 8800 berbasis CPU Intel 8080 diluncurkan, dan Gates dan Allen melihat peluncurannya sebagai kesempatan untuk mendirikan perusahaan perangkat lunak komputer sendiri. Ia telah membicarakan keputusan ini bersama orang tuanya yang sangat mendukungnya setelah mereka melihat antusiasme Gates untuk mendirikan perusahaan.\n<h3>Awal mula Microsoft</h3>\nSetelah membaca majalah Popular Electronic edisi Januari 1975 yang mendemonstrasikan Altair 8800, Gates menghubungi Micro Instrumentation and Telemetry System (MITS), pencipta mikrokomputer baru tersebut, dan menginformasikan bahwa ia dan teman-temannya sedang mengerjakan penerjemah BASIC untuk digunakan sebagai platformnya. Kenyataannya, Gates dan Allen tidak memiliki komputer Altair dan belum menulis sebarispun kode BASIC, mereka hanya ingin membuat MITS tertarik.\nMenanggapi informasi tersebut, Presiden MITS Ed Roberts setuju menemui mereka untuk melihat demonya. Dalam kurun beberapa minggu, mereka mengembangkan emulator Altair yang beroperasi di sebuah minikomputer dan kemudian penerjemah BASIC. Demonstrasi yang diadakan di kantor MITS di Albuquerque tersebut berhasil dan menghasilkan kesepakatan dengan MITS untuk mendistribusikan penerjemah ini dengan nama Altair BASIC.\nUntuk keperluan proyek ini, Paul Allen dipekerjakan di MITS. Gates kemudian memutuskan untuk absen dari Harvard untuk bekerja bersama Allen pada November 1975. Mereka membuat perusahaan kemitraan dan memberinya nama \"Micro-Soft\" dengan kantor pertamanya di Albuquerque. Satu tahun berikutnya, tanda penghubung pada nama \"Micro-Soft\" dihapus dan pada 26 November 1976, nama dagang \"Microsoft\" didaftarkan di Kementerian Luar Negeri New Mexico. Gates tidak pernah kembali ke Harvard untuk menyelesaikan studinya.\nSaat BASIC Microsoft dikenal secara luas oleh para penggemar komputer, Gates menemukan bahwa salinan pra-pasarnya telah bocor ke masyarakat dan didistribusikan secara meluas. Pada Februari 1976, Gates menulis \"Open Letter to Hobbyists\" di surat berita MITS yang menyatakan bahwa MITS tidak boleh memproduksi, mendistribusikan, dan mempertahankan perangkat lunak berkualitas tinggi tanpa membayarnya. Surat ini disambut dingin oleh banyak penggemar komputer, namun Gates mempertahankan keyakinannya bahwa para pengembang perangkat lunak harus mampu meminta bayaran.\nMicrosoft terbebas dari MITS pada akhir 1976 dan terus mengembangkan perangkat lunak bahasa pemrograman untuk berbagai sistem. Pada 1 Januari 1979, Gates memindahkan kantor pusat Microsoft dari Albuquerque ke Bellevue, Washington. Pada tahun-tahun awal Microsoft, semua karyawan punya tanggung jawab besar atas bisnis perusahaan. Gates mengawasi rincian bisnis dan juga menulis kode. Pada lima tahun pertama, Gates secara pribadi meninjau setiap baris kode yang dikirimkan perusahaan, dan sering menulis ulang beberapa bagian kode agar terlihat pas.\nMicrosoft meluncurkan versi ritel pertama Microsoft Windows pada 20 November 1985, dan pada bulan Agustus, perusahaan ini mencapai persetujuan dengan IBM untuk mengembangkan sistem operasi terpisah bernama OS/2. Meski kedua perusahaan ini berhasil mengembangkan versi pertama dari sistem ini, perbedaan tingkat kreativitas merusak kerja sama ini. Gates mengeluarkan memo internal pada 16 Mei 1991 yang mengumumkan bahwa kerja sama OS/2 berakhir dan Microsoft mengalihkan operasinya ke pengembangan kernel Windows NT."
    },
    {
        "key" : "steve-jobs",
        "image" : "../../assets/image/8-des-2022/steve-jobs.jpg",
        "title" : "Steven Paul Jobs",
        "detail" : "Jobs lahir di San Francisco, California dan diadopsi oleh Paul dan Clara Jobs (née Hagopian) dari Mountain View, California, yang menamainya Steven Paul. Paul dan Clara kemudian mengadopsi anak perempuan yang diberi nama Patti. Orang tua biologis Jobs – Abdulfattah Jandali, seorang sarjana berkebangsaan Suriah yang kemudian menjadi profesor ilmu politik, dan Joanne Simpson (née Schieble), seorang sarjana berkebangsaan Amerika Serikat yang kemudian menjadi patolog bahasa wicara – yang kemudian menikah, melahirkan dan membesarkan adik biologis Jobs, yaitu novelis Mona Simpson. \n Jobs bersekolah di Cupertino Junior High School dan Homestead High School di Cupertino, California, dan sering menghadiri kuliah setelah sekolah di Hewlett-Packard Company di Palo Alto, California. Ia kemudian dipekerjakan di sana dan bekerja bersama Steve Mozniak sebagai karyawan musim panas. Tahun 1972, Jobs lulus dari sekolah menengah atas dan mendaftar masuk Reed College di Portland, Oregon. Meski ia keluar setelah satu semester, ia melanjutkan audit kelasnya di Reed, seperti kelas Kaligrafi, dengan tidur di lantai kamar temannya, mengembalikan botol-botol Coke demi mendapatkan uang, dan mendapatkan makanan gratis mingguan di wihara Hare Krishna setempat. Jobs kemudian berkata, \"Jika aku tidak menghadiri kuliah tunggal di perguruan tinggi itu, maka Mac tidak akan memiliki beragam huruf cetak ataupun huruf dengan spasi sejajar.\" /n Pada musim gugur 1974, Jobs kembali ke California dan mulai menghadiri petemuan Homebrew Computer Club bersama Wozniak. Ia mengambil pekerjaan sebagai teknisi di Atari, sebuah perusahaan pembuat berbagai permainan video populer, dengan tujuan utama menabung uang untuk melakukan perjalanan spiritual ke India. \n Jobs kemudian berangkat ke India untuk mengunjungi Neem Karoli Baba di Kainchi Ashram-nya bersama seorang teman dari Reed College (yang kelak menjadi karyawan Apple pertama), Daniel Kottke, untuk mencari pencerahan spiritual. Ia pulang dalam keadaan menganut agama Buddha dengan kepala tercukur dan mengenakan pakaian tradisional India. Pada waktu itu, Jobs sedang bereksperimen dengan obat psikedelik dan menyebut pengalaman LSD -nya sebagai \"satu dari dua atau tiga hal terpenting yang pernah dilakukan dalam kehidupan dirinya\". Ia mengatakan bahwa orang-orang di sekitarnya yang tidak termasuk dalam silsilah lintas budayanya tidak dapat memahami sepenuhnya setiap pemikirannya. \n Jobs kembali ke pekerjaan sebelumnya di Atari dan diberikan tugas menciptakan papan sirkuit untuk permainan Breakout. Menurut pendiri Atari Nolan Bushnell, Atari menawarkan $100 untuk setiap chip yang dihapuskan di mesin ini. Jobs punya sedikit ketertarikan atau pengetahuan dalam desain papan sirkuit dan membuat persetujuan dengan Wozniak untuk membagi bonusnya sama rata jika Wozniak mampu meminimalkan jumlah chip. Atari sangat terkejut karena Wozniak mengurangi jumlah chip sebanyak 50 buah, sebuah desain yang sangat ketat sampai-sampai mustahil untuk menciptakannya kembali di jalur perakitan. Pada waktu itu, Jobs memberitahu Wozniak bahwa Atari hanya memberi mereka $700 (bukannya $5000) dan Wozniak pun mendapat bagian $350. \n <h4>Awal mula Apple Computer</h4> \n Tahun 1976, Steve Jobs, Steve Wozniak dan Ronald Wayne, dengan pendanaan dari manajer pemasaran produk dan teknisi semi-pensiun Intel A.C. “Mike” Markkula Jr, mendirikan Apple. Sebelum mendirikan Apple bersama-sama, Wozniak adalah peretas barang elektronik. Jobs dan Wozniak telah berteman selama bertahun-tahun, bertemu tahun 1971 ketika teman mereka, Bill Fernandez, memperkenalkan Wozniak yang berusia 21 tahun kepada Jobs yang berusia 16 tahun. Steve Jobs berusaha membuat Wozniak tertarik merakit komputer dan menjualnya. Ketika Apple terus meluas, perusahaan mulai mencari eksekutif berpengalaman untuk membantu mengelola ekspansinya. \n Tahun 1978, Apple merekrut Mike Scott dari National Semiconductor untuk menjabat sebagai CEO yang berujung pada tahun-tahun kelam. Tahun 1983, Steve Jobs berhasil memancing Jhon Sculley keluar dari Pepsi-Cola untuk menjabat sebagai CEO Apple dengan menanyakan, \"Apakah kau mau menjual air gula sepanjang hidupmu, atau kau mau bekerja bersamaku dan mengubah dunia?\" Pada tahun berikutnya, Apple menyiarkan iklan televisi Super Bowl berjudul \"1984\". Pada pertemuan pemegang saham tahunan Apple tanggal 24 Januari 1984, Jobs yang emosional memperkenalkan Machintos kepada hadirin yang sangat antusias. Andy hertzfled menggambarkan suasana tersebut sebagai \"pandemonium.\" Macintosh menjadi komputer kecil pertama yang sukses secara komersial dengan antarmuka pengguna grafis. Pengembangan Mac dimulai oleh Jef Raskin, dan diambil alih oleh Jobs. \n Meski Jobs digambarkan sebagai direktur Apple yang persuasif dan karismatik, sejumlah karyawannya pada waktu itu menggambarkannya sebagai manajer yang selalu berubah pikiran dan temperamental. Penurunan penjualan di seluruh industri menjelang akhir 1984 mengakibatkan keretakan hubungan kerja Jobs dengan Sculley, dan pada akhir Mei 1985  setelah ketegangan internal dan pengumuman PHK besar-besaran –Sculley mengakhiri jabatan Jobs sebagai kepala divisi Macintosh. "
    }, 
    {
        "key" : "mark-zuckerberg",
        "image" : "../../assets/image/8-des-2022/mark-zuckerberg.webp",
        "title" : "Mark Elliot Zuckerberg",
        "detail" :"Mark Zuckerberg lahir tahun 1984 di White Plains, New York dari pasangan Karen, seorang psikiater, dan Edward Zuckerberg, seorang dokter gigi. Ia bersama tiga saudara perempuannya, Randi, Donna, dan Arielle, dibesarkan di Dobbs Ferry, New York. Zuckerberg dibesarkan sebagai seorang Yahudi dan menjalani bar mitzvah ketika menginjak usia 13 tahun, meski selama ini ia menetapkan dirinya sebagai seorang ateis.\n  Di Ardsley High School, Zuckerberg mendapat nilai tinggi pada mata pelajaran Klasika sebelum pindah ke Philips Exeter Academy pada tahun pertamanya, tempat ia mendapat banyak hadiah dalam bidang sains (matematika, astronomi, dan fisika) dan ilmu klasik (dalam formulir pendaftaran perguruan tingginya, Zuckerberg memasukkan bahasa Prancis, Ibrani, Latin, dan Yunani Kuno dalam kolom bahasa non-Inggris yang bisa ia baca dan tulis) swerta merupakan seorang bintang anggar dan kapten tim anggar. Di perguruan tinggi, ia dikenal karena mengutip beberapa kalimat dari puisi-puisi epik seperti Iliad.\n  Pada sebuah pesta yang diadakan persaudaraannya pada tahun kedua di universitas, Zuckerberg bertemu mft, seorang mahasiswa Cina-Amerika asal pinggiran kota Boston (Braintree, Massachusetts), dan mereka terus berkencan, sempat putus sebentar, sejak 2003. Pada September 2010, Zuckerberg mengundang Chan yang sudah menjadi mahasiswi kedokteran di Universitas California, San francisco, untuk pindah ke rumah sewaannya di Palo Alto. Zuckerberg mempelajari Bahasa tionghoa mandarin setiap hari sebagai persiapan kunjungan keduanya ke Tiongkok pada bulan Desember 2010. Hingga 2010, Facebook diblokir oleh tembok api internet negara itu.\n Zuckerberg adalah anggota Alpha Epsilon Pi. Pada awalnya Mark Zuckerberg hanyalah seorang mahasiswa dari Universitas Harvard. Zuckerberg lalu membuat suatu sistem jejaring sosial untuk kelasnya. Tetapi setelah ia membuat sistem tersebut, ternyata semakin banyak saja orang yang tergabung didalamnya. Sistem itu lama-kelamaan telah menjaring universitas terdekat dari tempatnya kuliah, dan inilah awal dari Facebook yang kita kenal saat ini.\n Dari situasi inilah, Zuckerberg berinisiatif untuk mengembangkan sistem jejaring tersebut. Mula-mula Zuckerberg mengembangkan sistem ini dan memberi nama Facebook. Zuckerberg dan kawan-kawannya lalu menyewa tempat di Palo Alto, Claifornia sebagai tempat untuk mengembangkan Facebook. Karena keasyikan untuk mengembangkan proyek Facebook, maka Zuckerberg lupa akan kuliahnya. Zuckerberg dihadapkan pada pilihan-pilihan yang sulit antara memilih pendidikannya atau bisnis proyek yang sedang dia kembangkan. Dengan sikap yang optimis Zuckerberg dan kawan-kawannya memilih untuk meninggalkan kuliah mereka, dan memfokuskan diri pada proyek Facebook tersebut.\n <h4>Awal mula facebook</h4>\n Zuckerberg meluncurkan Facebook dari kamar asrama Harvard pada tanggal 4 Februari 2004. Sebuah inspirasi awal Facebook mungkin berasal dari Phillips Exeter Academy, sekolah tinggi swasta di mana Zuckerberg lulus tahun 2002. Ini mempublikasikan direktori mahasiswa sendiri, buku angkatan yang oleh siswa disebut sebagai \"The Facebook\". Direktori foto semacam itu merupakan bagian penting pengalaman sosial bagi kebanyakan siswa di sekolah swasta. Dengan hal tersebut, siswa dapat mendaftar berbagai hal seperti tahun angkatan, kedekatan mereka dengan teman-teman, dan nomor telepon mereka.\n Setelah kuliah, Facebook dimulai dari hanya sebagai \"barang Harvard\" sampai akhirnya Zuckerberg memutuskan untuk menyebarkan ke sekolah lain, mendaftar dengan bantuan dari teman sekamarnya Dustin Moskovitz. Mereka pertama kali dimulai dari Stanford, Dartmouth, Columbia, New York University, Cornell, Brown, dan Yale, dan kemudian di sekolah lain yang memiliki kontak sosial dengan Harvard University.\n Zuckerberg pindah ke Palo Alto, California, bersama Moskovitz dan beberapa teman. Mereka menyewa sebuah rumah kecil yang berfungsi sebagai kantor. Selama musim panas, Zuckerberg bertemu Peter Thiel yang menginvestasikan pada perusahaan. Mereka mendapat kantor pertama mereka di pertengahan tahun 2004. Menurut Zuckerberg, mereka berencana untuk kembali ke Harvard tetapi akhirnya memutuskan untuk tetap di California. Mereka telah menolak tawaran oleh perusahaan besar yang akan membeli Facebook. Dalam sebuah wawancara pada tahun 2007, Zuckerberg menjelaskan alasannya:\n  “Ini bukan soal uang. Bagi saya dan rekan saya, hal yang paling penting adalah bahwa kita menciptakan aliran informasi yang terbuka untuk orang-orang. Perusahaan media yang dimiliki oleh konglomerat hanya bukan ide menarik bagi saya.” Dia mengungkapkan kembali tujuan-tujuan yang sama kepada majalah Wired pada tahun 2010: \"Yang saya pedulikan adalah misi, membuat dunia terbuka.\" Sebelumnya, pada bulan April 2009, Zuckerberg meminta nasihat dari mantan CFO Netscape Peter Currie tentang strategi pembiayaan untuk Facebook.\n Pada tanggal 21 Juli 2010, Zuckerberg melaporkan bahwa perusahaan mencapai angka 500 juta pengguna. Ketika ditanya apakah bisa mendapatkan penghasilan lebih banyak dari iklan sebagai hasil dari pertumbuhan yang fenomenal, ia menjelaskan: “Saya kira kami bisa ... Jika anda melihat berapa banyak halaman kami diambil untuk porsi iklan dibandingkan dengan rata-rata permintaan pencarian. Rata-rata bagi kita adalah sedikit kurang dari 10 persen dari halaman, dan rata-rata untuk pencarian adalah sekitar 20 persen yang diambil dengan iklan. Itu hal sederhana yang bisa kami lakukan. Tapi kami tidak seperti itu. Kami menghasilkan cukup uang. Benar, maksud saya, kita menjaga hal-hal berjalan, kita tumbuh pada tingkat yang kita inginkan.”\n Pada bulan Agustus 2004, Zuckerberg, Andrew McCollum, Adam D'Angelo, dan Sean Parker meluncurkan layanan berbagi berkas yang bersaing disebut Wirehog. Itu adalah pendahulu untuk aplikasi Facebook Platform. Daya tariknya rendah dibandingkan dengan i2hub, dan Facebook akhirnya menutup Wirehog down musim panas berikutnya."
    }, 
    {
        "key" : "jeff-bezos",
        "image" : "../../assets/image/8-des-2022/jeff-bezos.jpg",
        "title" : "Jeffrey Preston Bezos",
        "detail" :"Nenek moyang Bezos adalah orang Texas yang secara turun temurun memiliki peternakan seluas 101 km² di Cotulla. Kakeknya adalah direktur regional Komisi Energi Atom Amerika di Albuquerque yang minta pensiun lebih awal untuk bekerja di peternakan. Pada masa remaja, Bezos sering menghabiskan musim panas bersama kakeknya. Sejak kecil, Bezos sudah memperlihatkan bakatnya di bidang mekanik. Bezos balita pernah mencoba membongkar sendiri tempat tidur miliknya dengan obeng.\n Bezos dilahirkan ketika ibunya yang bernama Jackie Bezos masih berusia belasan tahun. Pernikahan ayah dan ibunya hanya bertahan setahun lebih. Ibunya menikah kembali ketika Bezos masih berusia lima tahun. Ayah tiri Bezos yang bernama Miguel Bezos adalah imigran asal Kuba. Miguel Bezos datang sendirian ke Amerika Serikat sewaktu masih berusia 15 tahun hingga akhirnya diterima di Universitas Albuquerque. Keluarga Bezos pindah ke Houston, Texas, dan Miguel Bezos bekerja sebagai insiyur di Exxon. Kelas 4 hingga kelas 6 dilewatkan Bezos kecil di Sekolah Dasar River Oaks Elementary, Houston.\nBezos menunjukkan minatnya pada bidang ilmu sejak masih muda. Ia mengutak-utik alarm listrik supaya sang adik tidak masuk ke kamarnya. Garasi orang tua juga dijadikannya laboratorium untuk eksperimen ilmiah. Setelah orang tuanya pindah ke Miami, Florida, Bezos melanjutkan ke Sekolah Menengah Atas Miami Palmetto. Ketika diterima di Universitas Princeton, Bezos ingin mengambil jurusan fisika, tetapi berubah pikiran dan mendalami komputer hingga lulus dengan gelar di bidang ilmu komputer dan Teknik listrik.\n <h4>Awal mula Amazon </h4>\nSetelah lulus dari Princeton, Bezos mendapat pekerjaan di Wall Street yang berhubungan dengan komputer. Jaringan komputer dibangunnya di sebuah gedung yang dijadikan pusat perdagangan internasional oleh perusahaan bernama Fitel. Selanjutnya Bezos bekerja untuk D. E. Shaw & Co.\nPada tahun 1994 Bezos mendirikan situs web Amazon.com. Model bisnis Amazon.com dirancangnya sewaktu mengendarai mobil dari New York ke Seattle. Kantor Amazon.com yang pertama adalah garasi rumah Bezos. Situs web Amazon.com yang didirikan Bezos membawanya sebagai salah seorang pengusaha sukses era dot-com. Pada tahun 2004, Bezos mendirikan perusahaan bernama Blue Origin yang bergerak di bidang penerbangan sipil angkasa luar."
    }, 
    {
        "key" : "berners-lee",
        "image" : "../../assets/image/8-des-2022/berners-lee.jpg",
        "title" : "Sir Timothy John Berners-Lee ",
        "detail" :"Pada tahun 1989, saat bekerja di di CERN, Laboratorium Fisika Partikel Eropa di Jenewa, Swiss, Tim Berners-lee mengusulkan proyek hypertext global, dikenal sebagai World Wide Web. Berdasarkan sebelumnya \"Enquire\" bekerja, ia dirancang untuk memungkinkan orang untuk bekerja sama dengan menggabungkan pengetahuan mereka dalam web dokumen hypertext. Dia menulis World Wide Web server pertama, \"httpd\", dan klien pertama, \"WorldWideWeb\" apa-kau-lihat-ini-apa-kau-mendapatkan peramban hypertext atau Editor yang berlari di lingkungan NeXTStep. Pekerjaan ini dimulai pada bulan Oktober 1990, dan program \"WorldWideWeb\" pertama kali dibuat tersedia dalam CERN pada bulan Desember, dan di Internet pada umumnya pada musim panas 1991.\n Melalui 1991 dan 1993, Tim terus bekerja pada desain Web, koordinasi umpan balik dari pengguna di Internet. Spesifikasi awalnya URI, HTTP dan HTML yang disempurnakan dan dibahas di kalangan yang lebih besar seperti penyebaran teknologi Web.\n Tim Berners-Lee lulus dari Universitas Queen di Oxford University, Inggris, 1976 Sementara di sana ia membangun komputer pertama dengan solder besi, gerbang TTL, prosesor M6800 dan televisi tua. Dia menghabiskan dua tahun dengan Plessey Telecommunications Ltd (Poole, Dorset, Inggris) produsen peralatan utama UK Telecom, bekerja pada sistem terdistribusi transaksi, relay pesan, dan teknologi bar code.\n Pada tahun 1978 Tim meninggalkan Plessey untuk bergabung DG Nash Ltd (Ferndown, Dorset, Inggris), di mana ia menulis antara software hal-hal typesetting lainnya untuk printer cerdas, dan sistem operasi multitasking.\n Setahun setengah dihabiskan sebagai konsultan independen termasuk tugas (Jun-Desember 1980) enam bulan sebagai insinyur perangkat lunak konsultan di CERN. Sementara di sana, ia menulis untuk penggunaan pribadi sendiri Program pertamanya untuk menyimpan informasi termasuk menggunakan asosiasi acak. Dinamakan \"Enquire\" dan tidak pernah dipublikasikan, program ini membentuk dasar konseptual untuk pengembangan masa depan dari World Wide Web.\n     Dari tahun 1981 sampai 1984, Tim bekerja di John Poole Citra Computer Systems Ltd, dengan tanggung jawab desain teknis. Bekerja di sini termasuk real time kontrol firmware, grafis dan perangkat lunak komunikasi, dan bahasa makro generik. Pada tahun 1984, ia mengambil sebuah persahabatan di CERN, untuk bekerja pada sistem terdistribusi real-time untuk akuisisi data ilmiah dan sistem kontrol. Antara lain, dia bekerja pada perangkat lunak sistem FASTBUS dan merancang sebuah sistem panggilan prosedur heterogen terpencil.\n Pada tahun 1994, Tim mendirikan World Wide Web Consortium di kemudian Laboratorium Ilmu Komputer (LCS) yang bergabung dengan Artificial Intelligence Lab pada tahun 2003 untuk menjadi Ilmu Komputer dan Kecerdasan Buatan Laboratorium (CSAIL) di Massachusetts Institute of Technology (MIT) . Sejak saat itu ia menjabat sebagai Direktur World Wide Web Consortium organisasi standar Web yang mengembangkan teknologi interoperable (spesifikasi, pedoman, perangkat lunak, dan alat-alat) untuk memimpin Web secara maksimal. Konsorsium memiliki situs tuan rumah yang terletak di MIT, di ERCIM di Eropa, dan di Universitas Keio di Jepang serta Kantor di seluruh dunia.\n Pada tahun 1999, ia menjadi pemegang pertama dari kursi 3Com Pendiri. Pada tahun 2008 ia diangkat 3COM Pendiri Profesor Teknik di Sekolah Teknik, dengan janji bersama di Departemen Teknik Elektro dan Ilmu Komputer di CSAIL di mana ia juga mengepalai Informasi Desentralisasi Group (DIG). Pada bulan Desember 2004 ia diangkat menjadi Profesor di Departemen Ilmu Komputer di University of Southampton, Inggris. Dia adalah co-Direktur Web Ilmu Trust, diluncurkan pada tahun 2006 sebagai Web Science Research Initiative, untuk membantu menciptakan tubuh penelitian multidisiplin pertama yang meneliti World Wide Web dan menawarkan solusi praktis yang diperlukan untuk membantu memandu penggunaan dan desain masa depan. Dia adalah Direktur World Wide Web Foundation, dimulai pada 2008 untuk mendanai dan mengkoordinasikan upaya-upaya untuk memajukan potensi Web untuk manfaat kemanusiaan.\n Pada bulan Juni 2009 lalu Perdana Menteri Gordon Brown mengumumkan bahwa ia akan bekerja sama dengan Pemerintah Inggris untuk membantu membuat data lebih terbuka dan dapat diakses di Web, membangun karya Kekuatan Informasi Task Force. Sir Tim adalah anggota dari The Sektor Publik Transparansi Dewan bertugas untuk mendorong maju agenda transparansi Pemerintah Inggris. Dia telah mempromosikan data pemerintah terbuka secara global, adalah anggota Dewan Transparansi Inggris. Dia adalah Presiden Data Terbuka Institute di Inggris. Dia adalah penulis, dengan Mark Fischetti, buku \"Weaving the Web\" pada masa sekarang masa lalu dan masa depan Web.\n  Pada 18 Maret 2013, Tim, bersama dengan Vinton Cerf, Robert Kahn, Louis Pouzin dan Marc Andreesen, dianugerahi Ratu Elizabeth Prize for Engineering untuk \"tanah-melanggar inovasi dalam rekayasa yang telah memberikan manfaat global untuk kemanusiaan.\""
    }, 
    {
        "key" : "larry-page",
        "image" : "../../assets/image/8-des-2022/larry-page.jpeg",
        "title" : "Lawrence Edward Page",
        "detail" :"Page adalah seorang lulusan dari East Lansing High School. Page memperoleh gelar Bachelor Of Science dalam teknik komputer dari Universitas Michigan  dengan pujian dan seorang lulusan Master dari Universitas Stanford di Amerika serikat.\n Larry Page dilahirkan di Lansing, Michigan, ayahnya Carl Page dan ibunya, Gloria, adalah seorang Yahudi dan profesor Ph.D. di bidang Komputer Sains di Universitas Negri Michigan. Page adalah seorang lulusan dari East Lansing High School. Page memperoleh gelar Bachelor Of Science dalam teknik komputer dari Universitas Michigan  dengan pujian dan seorang lulusan Master dari Universitas Stanford di Amerika serikat.\n Ketika menjadi seorang siswa di program Ph.D. ilmu komputer Universitas Stanford, Page bertemu Sergey Brin. Pada awalnya mereka merasa tidak cocok. Hal ini disebabkan karena perbedaan dari setiap topik yang mereka bicarakan. Namun, pada akhirnya mereka memiliki ketertarikan yang sama yaitu mengenai mesin pencari (search engine). Bersama mereka menjalankan mesin pencari Google , yang mulai beroperasi pada 1998. Google didasarkan pada teknologi PageRank yang telah dipatenkan, yang mendasarkan pada struktur link – link antar situs web untuk menentukan peringkat suatu situs tertentu. Page masih tetap on leave dari program Ph.D.\n Ketika di universitas, dia membuat mesin cetak inkjent dari potongan-potongan balok Lego. Page menjalankan Google sebagai presiden bersama dengan Brin sampai 2001, ketika mereka merekrut Eric Schmidt untuk menjadi ketua umum dan CEO Google. Page sekarang menjalankan Google sebagai tritunggal bersama dengan Brin dan Schmidt.\n Menurut Forbes, Page mempunyai perkiraan kekayaan bersih sebesar AS$12,8 miliar, membuatnya orang nomor 27 terkaya di dunia (satu tempat di belakang pendiri lain Google, Sergey Brin). Pada September 2005 dia dan pendiri Google lainnya, Sergey Brin, membeli sebuah pesawat penumpang yang sangat besar, sebuah Boeing 767, untuk penggunaan pribadi mereka.\n Di bulan April 2021, Bloomberg Billionaire Index menyebutkan bahwa Larry Page mempunyai kekayaan melebihi AS$100 milyar. Kekayaan Page meningkat pesat setelah terjadinya pandemi COVID-19 Perusahaan induk Google yaitu Alphabet, menjelaskan bahwa peningkatan performa perusahaan terjadi karena lebih banyaknya orang yang mengakses Youtube dan Google Search. Dan meningkatnya performa perusahaan ini telah menambah kekayaan Page sebesar $21 miliar dalam waktu empat bulan di awal tahun 2021."
    }, 
    {
        "key" : "martin-cooper",
        "image" : "../../assets/image/8-des-2022/martin-cooper.jpg",
        "title" : "Martin Cooper",
        "detail" :"Martin Cooper dibesarkan di Chicago ketika terjadi masa resesi dunia. Orang tuanya adalah imigran Ukraina. Ia menerima gelar sarjana di bidang Electrical Engineering pada tahun 1950. Maritin cooper adalah seorang lulusan dari universitas Illinois Intitute Of Technology Sarjana dalam Teknik Kelistrikan dan Magistrat dalam Teknik Kelistrikan.\nMartin Cooper bergabung dengan Reserve Officers Training Corps Angkatan Laut Amerika Serikat. Ia bertugas di kapal perusak Angkatan Laut AS selama Perang Korea dan kemudian di sebuah kapal selam yang bermarkas di Hawaii.\nSetelah perang usai, Cooper meninggalkan angkatan laut dan mulai bekerja di Teletype, anak perusahaan Western Electric. Pada tahun 1954, ia pindah ke Motorola. Sambil bekerja di sana ia meneruskan studinya dimalam hari. Pada tahun 1957, ia menerima gelar Magister dalam bidang rekayasa elektronika dari Illinois Institute of Technology.\nPada tahun 1960 ia berperan penting dalam mengubah lembaran teknologi informasi yang sebelumnya terbatas digunakan dalam satu bangunan tunggal menjadi semakin luas yang dapat menghubungkan antar kota. Cooper membantu memperbaiki cacat dalam kristal Motorola yang dibuat untuk radio. Hal ini mendorong perusahaan untuk memproduksi massal kristal kuarsa pertama untuk digunakan dalam jam tangan quartz.\n    Pada tahun 1960, John F. Mitchell menjadi kepala insinyur proyek komunikasi portabel Motorola. Pada awal 1970-an, Mitchell memberi tanggung jawab pada Cooper di divisi telepon mobil (Carphone). Mitchell dan Cooper membayangkan sebuah produk komunikasi yang tidak hanya terpaku di dalam mobil. Sehingga alat tersebut haruslah kecil dan cukup ringan untuk menjadi alat portabel. Butuh waktu 90 hari pada tahun 1972 untuk menciptakan prototipe pertama dari ide tersebut.\nCooper dan para insinyur yang bekerja untuknya, serta Mitchell mempatenkan penemuan \"Radio Telephone System\" yang diajukan pada 17 Oktober 1973 dengan nomor paten 3906166 dan disetujui pada September 1975 atas nama mereka. Cooper dianggap sebagai penemu pertama telepon genggam seluler (handphone) pertama dan orang pertama yang melakukan panggilan dengan prototipe ponsel genggam seluler tersebut pada 3 April 1973. Kejadian yang bersejarah tersebut disaksikan di muka umum di depan wartawan dan orang orang yang lewat di jalan kota New York. Panggilan pertama ditujukan kepada Dr. Joel S. Engel, kepala riset di Bell Labs.\nPanggilan pertama tersebut sebagai awal penanda mulainya pergeseran fundamental teknologi dan pasar komunikasi ke arah komunikasi telepon yang portabel dimana seseorang dapat langsung berkomunikasi langsung dengan orang lain, tidak lagi seperti dahulu kala dimana yang dituju adalah tempat sebagaimana telepon rumah. Ini adalah karya hasil dari visinya bagi komunikasi telepon genggam nirkabel personal yang membedakannya dari telepon mobil (Car Phones). Cooper kemudian mengungkapkan bahwa ia mendapat ide untuk mengembangkan ponsel setelah menonton Kapten Kirk yang menggunakan suatu alat komunikator pada acara serial televisi Star Trek.Meskipun digelari sebagai ‘Bapak Telepon Selular (Ponsel)’, dengan rendah hati Martin Cooper mengatakan “Meskipun aku bagian dari penemuan tersebut, tapi karya tersebut adalah hasil kerja tim dan ratusan literatur orang orang yang menciptakan visi tentang bagaimana selular seperti hari ini, yang tentu belum sempurna. Kami masih terus bekerja dan berusaha untuk membuatnya lebih baik”."
    }, 
    {
        "key" : "kevin-david-mitnick",
        "image" : "../../assets/image/8-des-2022/david-mitnick.jpg",
        "title" : "Kevin David Mitnick",
        "detail" :" Kevin David Mitnick (lahir 6 Agustus 1963) adalah seorang konsultan dan pembuat keamanan komputer. Dia adalah salah satu hacker komputer yang paling kontroversial di akhir abad ke-20 yang merupakan kriminal komputer yang paling dicari di Amerika. Mitnick dibesarkan di Los Angeles dan bersekolah di Sekolah Tinggi Monroe. Ia mendaftar di Pierce College dan USC(University of Southern California). Ia bekerja sebagai resepsionis pada Stephen S. Wise Temple untuk sementara waktu. \n   Pada usia 15, Mitnick menggunakan rekayasa sosial untuk memotong sistem punch card digunakan dalam sistem bus Los Angeles. Setelah dengan ramah sopir bus memberitahunya di mana dia bisa membeli tiket sendiri meninju, dia bisa naik bus apapun di wilayah LA yang lebih besar menggunakan Transfer terpakai slip ia menemukan di tempat sampah. Social engineering menjadi metode utama nya untuk mendapatkan informasi, termasuk user-nama dan password dan nomor telepon modem.\nMitnick pertama mendapatkan akses tidak sah ke jaringan komputer pada tahun 1979, pada usia 16, ketika seorang teman memberinya nomor telepon untuk Tabut, sistem komputer Digital Equipment Corporation (DEC) yang digunakan untuk mengembangkan perangkat lunak RSTS / E sistem operasi mereka. Dia masuk ke jaringan komputer DEC dan disalin perangkat lunak mereka, kejahatan yang dituduh dan dihukum pada tahun 1988 Dia dihukum 12 bulan penjara diikuti oleh tiga tahun rilis diawasi. Menjelang akhir rilis diawasi, Mitnick menyusup ke Pacific Bell komputer pesan suara. Setelah surat perintah dikeluarkan untuk penangkapannya, Mitnick melarikan diri, menjadi buronan selama dua setengah tahun.\nMenurut Departemen Kehakiman AS, Mitnick mendapatkan akses tidak sah ke puluhan jaringan komputer sementara dia buronan. Ia memakai kloning telepon seluler untuk menyembunyikan lokasi dan menyalin perangkat lunak berpemilik yang berharga dari beberapa telepon seluler dan komputer terbesar perusahaan di negara itu. Mitnick juga mencegat dan mencuri password komputer, jaringan komputer diubah, dan masuk ke dan membaca e-mail pribadi. Mitnick ditangkap pada 15 Februari 1995, di Raleigh, North Carolina Dia ditemukan dengan ponsel kloning seluler, lebih dari 100 kode telepon seluler clone, dan beberapa bagian dari identifikasi palsu.\nSetelah pengejarannya dipublikasi, FBI menangkap Kevin Mitnick pada bulan Januari 1995 di apartemennya di kota Raleigh, North Carolina atas tuduhan penyerangan terhadap pemerintahan."
    }, 
    {
        "key" : "linus-benedist-torvalds",
        "image" : "../../assets/image/8-des-2022/linus.jpeg",
        "title" : "Linus Benedist Torvalds",
        "detail" :"Linus Benedict Torvalds (lahir 28 Desember 1969) adalah rekayasa perangkat lunak Finlandia yang dikenal sebagai perintis pengembangan Kernel Linux. Ia sekarang bertindak sebagai koordinator proyek tersebut. \n Linux terinsipirasi oleh Minix (sistem operasi yang dikembangkan oleh Andre S. Tanenbaum) untuk mengembangkan sistem operasi miirip Unix (Unix-like) yang dapat dijalankan pada sebuah PC. Linux sekarang dapat dijalankan pada berbagai arsitektur lain.\n  Ketika Linus Torvalds, seorang mahasiswa Finlandia pendiam membagi-bagikan kode sumber (source code) kernel Linux seukuran disket via internet pada tahun 1991, ia sama sekali tidak menduga bahwa apa yang dimulainya melahirkan sebuah bisnis bernilai miliaran dolar di kemudian hari.\n  Ia bahkan tidak menduga Linux kemudian menjadi sistem operasi paling menjanjikan, yang bisa dibenamkan ke dalam server, komputer desktop, tablet PC, PDA, ponsel, GPS, robot, mobil hingga pesawat ulang alik buatan NASA.\n  Saat ini 2,32% pangsa pasar desktop di seluruh dunia menggunakan Linux, macOS 8,41% dan Windows 88,79%. Linux juga menyumbangkan 68,71% pada sistem operasi telepon pintarnya dengan Andriod. Dan 35,9% server di seluruh dunia menggunakan Linux, melebihi Windows yang hanya 32,3%, jauh di atas UNIX, Berkeley Software Distributin (BSD), dan Solaris.\n  Saat ini Linus meninggalkan posisi menjanjikan di perusahaan semi konduktor Transmeta dan tinggal bersama istri dan 3 anaknya di sebuah bukit di desa di Portland, Oregon, AS, berdekatan dengan markas Open Source Development Labs. Organisasi nirlaba ini diawaki oleh 20-an pemrogram yang punya gairah hampir sama dengan Linus. Mereka terus mengembangkan kernel Linux yang kini berukuran 290-an MegaBytes atau melebihi 9 miliar baris kode. Linux beserta timnya menerima masukan baris-baris kode dari seluruh penjuru dunia, menyortir, menetapkan skala prioritas dan memasukkan gagasan paling brilian ke dalam kernel. LSD sendiri didukung oleh puluhan raksasa IT seperti IBM, HP, Dell dan Sun, baik dari sisi materi maupun sumber daya manusia.\n  Linus bukan orang pertama yang membagi-bagikan kode sumber karena pola ini adalah hal yang biasa pada masa awal tumbuhnya industri komputer. Tapi Linus sukses menetapkan standar yang memaksa banyak pengembang ikut membebaskan kode sumber program mereka, mulai dari BSD, Solaris, Suse, Java hingga Adobe.\n  Meski hanya bergaji ratusan ribu dolar pertahun, Linus telah menciptakan banyak multimiliarder dalam industri komputer mulai dari RedHat, Suse, Debian, Mandriva, Ubuntu dan banyak pengembang perangkat lunak sumber terbuka lainnya. Hampir tak ada yang berubah dari Linus. Ketika ia datang terlambat di suatu konferensi IT, ia bahkan tak segan-segan duduk di lantai dengan celana pendek dan sepatu-sandal kesukaannya. Ia bahkan tidak marah tatkala memberikan pidato di mimbar dan diinterupsi oleh beberapa pemrogram BSD yang maju ke depan panggung yang mengklaim bahwa kernel BSD jauh lebih hebat daripada kernel Linux. Ia bahkan tidak segan-segan memakai T-Shirt BSD yang disodorkan pemrotes dan melanjutkan pidatonya.\n  Menurut Linus, apa yang dilakukannya hanyalah untuk berbagi. Berbeda dengan Richard M. Stallman yang fanatik dengan konsep free software, Linus hanya menekankan sisi keterbukaan (open), tak peduli apakah kemudian dalam suatu sistem operasi bercampur program free dan proprietary.\n  Setiap kata-kata Linus hampir menjadi sabda di kalangan Linuxer yang menciptakan standar nilai tertentu. Setiap publikasi, pidato, surel, dan siaran persnya selalu ditunggu-tunggu jutaan orang. Di sela kesibukannya, Linus menyempatkan diri bersepeda menuruni bukit dan minum di bar desa. Pada 24 April 2012, Linus terpilih sebagai salah satu dari dua penerima penghargaan Millennium Technology Prize 2012, sebuah penganugerahan sekelas penghargaan Nobel di dunia teknologi.         "
    }, 
    {
        "key" : "elon-musk",
        "image" : "../../assets/image/8-des-2022/elon.jpeg",
        "title" : "Elon Reeve Musk",
        "detail" :"Musk adalah pendiri beberapa perusahaan teknologi populer, termasuk SpaceX yang bergerak di teknologi antariksa; Tesla Inc. yang bergerak di bidang otomotif, OpenAI, SolarCity, Neuralink, serta beberapa perusahaan lainnya. Musk menyatakan bahwa dengan perusahaan-perusahaan ini didirikannya dengan tujuan mengubah dunia dan kehidupan manusia termasuk mengurangi pemanasan global melalui peningkatan produksi dan konsumsi energi terbarukan. Ia juga berharap dapat mengurangi \"risiko punahnya umat manusia\" dengan meningkatkan teknologi untuk hidup di planet lain, khususnya di Mars.\nElon lulus dari Pretoria Boys High School dan pindah ke Kanada tahun 1989 pada usia 17 tahun untuk menghindari wajib militer di afrika selatan. Tahun 1992, setelah belajar selama dua tahun di Queen's University, kingston, ontario, Musk pindah ke wharton school di univesity of pennsylvania dan memperoleh gelar S1 dalam bidang ekonomi dan S1 kedua dalam bidang fisika. Ia pindah ke california untuk mengejar gelar Ph.D. dalam bidang fisika terapan di standford namun keluar setelah dua hari demi mengejar keinginannya untuk berwiraswasta di sektor internet, energi terbarukan , dan  luar angkasa.\nPada 1995, Musk, adiknya Kimbal, dan Greg Kouri mendirikan Zip2, sebuah perusahaan perangkat lunak  web, dengan dana dari pemodal mulia . Mereka mendirikan perusahaan tersebut di sebuah kantor sewaan kecil di Palo Alto. Perusahaan ini mengembangkan dan memasarkan sebuah \"panduan kota\" Internet untuk industri penerbitan surat kabar, dengan peta, penunjuk arah dan halaman kuning. Musk mengatakan bahwa sebelum perusahaannya sukses, karena ia tidak dapat membeli apartemen, ia menyewa sebuah kantor dan tidur di sofa dan mandi di YMCA. Ia juga menggunakan komputer bersama dengan adiknya. Ketika ia berbeda pendapat dengan adiknya tentang keputusan bisnis, mereka menyelesaikannya dengan bergulat. Menurut Musk, \"Situsnya berjalan di pagi hari dan saya menulis kodenya di malam hari, tujuh hari seminggu, setiap waktu\". Musk bersaudara mendapatkan kontrak dengan New York Times dan Chicago Tribune dan membujuk dewan direkturnya agar mau membatalkan rencana merger dengan perusahaan CitySearch. Compaq mengakuisisi Zip2 senilai US$307 juta secara tunai dan US$34 juta dalam bentuk opsi saham pada tahun 1999, dan Musk menerima 7% atau $22 juta dari penjualan tersebut\nMusk memanfaatkan hasil penjualan Zip2-nya sebesar $10 juta untuk mendirikan layanan keuangan dalam jaringan bernama X.com pada bulan Maret 1999. Musk merekrut eksekutif bisnis John Story dan Bill Hariss sebagai investor dan Harris menjadi presiden dan CEO perusahaan. Musk menjadi ketua perusahaan dan menerima modal sebesar $25 juta dari firma modal usaha Seqioa Capital Perusahaan ini mulai meluncurkan layanannya pada Desember 1999 yang menyediakan rekening dan kartu tunai Internet.\n Beberapa bulan kemudian, X.com mengakuisisi Confinity, perusahaan yang mengoperasikan layanan transfer uang bernama PayPal. Pendiri pendamping Confinity, Max Lechin, dan salah satu investor perusahaan mendepak Musk dari jabatannya sebagai CEO X.com.  Sistem PayPal baru berusia beberapa bulan dan Musk merasa PayPal punya masa depan yang menjanjikan.  Musk dan Harris kali ini tidak sepakat dan Harris keluar dari perusahaan pada Mei 2000.  Bulan Oktober 2000, Musk memutuskan bahwa X.com akan menghentikan operasi perbankan Internetnya dan berfokus pada layanan uang PayPal, X.com berganti nama menjadi PayPal dan berekspansi cepat tahun 2001 karena digunakan oleh eBay. Perusahaan yang baru berganti nama ini membuka diri sebagai perusahaan yang diperdagangkan publik pada Februari 2002 dan diakuisisi eBay senilai $1,5 miliar dalam bentuk saham pada akhir 2002. 11,5% saham Musk atas perusahaan terakuisisi ini berbuah $165 juta dalam bentuk saham eBay."
    }, 
    {
        "key" : "jack-ma",
        "image" : "../../assets/image/8-des-2022/jack-ma.jpg",
        "title" : "Jack Ma",
        "detail" :"Jack Ma (lahir 10 September 1964) merupakan seorang pebisnis berkebangsaan tionkok. Dia merupakan pendiri sekaligus Chairman Eksekutif dari alibaba Group, perusahaan e-commerce terbesar di Tiongkok. Dia merupakan warga tiongkok daratan pertama yang pernah muncul di majalah Forbes dan terdaftar sebagai biliuner dunia. Pada 2015, ia masuk dalam daftar orang paling berpengaruh di dunia pada urutan ke-22. Jack Ma secara resmi mengundurkan diri dari dewan direksi Alibaba pada 30 September 2019. \nJack Ma memilih jurusan Bahasa Inggris di Hangzhou Normal University dan Cheung Kong Graduate School of Business. Pebisnis asal China ini bahkan dilaporkan sampai empat kali mencoba masuk ke perguruan tinggi.\n Sebagai seorang miliader, ternyata Jack Ma dilahirkan dari keluarga ekonomi lemah. Dia dilahirkan di daerah Hangzhou, Provinsi Zhejiang, Tiongkok. Orangtuanya adalah pemusik dan pendongeng tradisional, ayahnya hanya mendapatkan tunjangan pensiunan bulanan sebesar sekitar Rp 500.000 untuk menghidupi keluarganya. Saat umur 12 tahun, Jack Ma sudah tertarik untuk belajar bahasa Inggris, selama delapan tahun masa kecilnya dihabiskan sebagai pemandu wisata di sebuah hotel di dekat Danau Hangzhou , sekitar 160 kilometer dari Shanghai. Waktu itu Tiongkok baru mulai membuka diri dan mulai banyak turis yang datang ke Tiongkok. Hal inilah yang membantu dia lebih terbuka pemikirannya dibandingkan teman-teman seumurnya.\n  Selanjutnya dia mendaftar ke Universitas Keguruan Hangzhou, semacam institut keguruan dan ilmu pendidikan. Di sini dia belajar menjadi guru sekolah menengah. Setelah lulus dari Universitas, dengan gelar Sarjana di bidang bahasa Inggris, dia ditugaskan mengajar di universitas. Ketika itu gaji Ma sebulan sebesar 100-120 renminbi, setara dengan Rp 114.000-Rp 142.500 per bulan. Pada tahun 1992, saat perekonomian Tiongkok mulai bertumbuh, dia mencoba melamar di berbagai pekerjaan, akhirnya ia menjadi sekretaris general manager gerai penjual ayam goreng Kentucky Fried Chicken. Di sinilah ia bekenalan dengan komputer dan internet, dari seorang teman. Ketika dia mencari kata \"beer\" di mesin pencari Yahoo, dia menemukan kenyataan bahwa tidak ada data tentang Tiongkok. Akhirnya dia tertarik pada komputer dan meminjam uang 2.000 dollar AS dari kerabatnya untuk mendirikan perusahaan komputer. Padahal dia tidak mengerti tentang komputer ataupun surat elektronik, bahkan dia tidak pernah menyentuh papan tik komputer sebelumnya.\n  Setelah mengenal internet inilah, dia memutuskan untuk memfasilitasi para pedagangan Tiongkok menjual barang ke luar negeri melalui dunia maya, dia mendirikan Alibaba. Sekarang perusahaan yang dia pimpin, Alibaba Group bernilai lebih dari US$ 200 miliar setelah melantai di Bursa New York pada Oktober 2014.\n  Pada bulan Januari 2021, Jack Ma dilaporkan 'menghilang' dari publik selama lebih dari dua bulan (Oktober 2020), termasuk persensinya di acara pencarian bakat TV-nya sendiri. Dia menghilang tak lama setelah membuat komentar kritik tentang pemerintah Tiongkok. David Faber dari CNBC kemudian melaporkan bahwa Jack Ma sengaja 'bersembunyi' karena penyelidikan pemerintah Tiongkok terhadap bisnisnya.\n  Setelah 3 bulan sengaja bersembunyi dari publik jack ma kembali muncul di hadapan publik tepat 20 Januari 2021 dengan video singkat yang berisi menyampaikan sambutan kepada guru penerima penghargaan Jack Ma Rural Teachers Award.         "
    }, 
    {
        "key" : "walt-disney",
        "image" : "../../assets/image/8-des-2022/walt-disney.webp",
        "title" : "Walter Elias Disney",
        "detail" :"Walter Aleas Disney atau lebih dikenal dengan sebutan Walt Disney lahir pada tanggal 5 Desember 1901 di Chicago, Amerika Serikat. Walt Disney adalah tokoh legenda abad ke-20 an di bidang hiburan. Sesosok tokoh yang mampu menunjukan kepada dunia bahwa segala impian dapat diraih dengan kerja keras, optimisme, kreativitas, imajinasi dan kenyakinan. \nBerawal dari profesi animator beliau masuk ke industri hiburan. Melalui karya karyanya, beliau mampu menyakinkan dunia akan keberadaannya. Seiring popularitasnya yang kian menanjak, kekreatifitasan dan imajinasinya melambungkannya sebagai seorang sutradara, produser film, hingga yang paling menakjubkan adalah sebagai seorang pendiri The Walt Disney Company. Sebuah perusahaan hiburan tersohor di seluruh  dunia yang hingga kini masih berdiri dengan kokoh, dan mampu mendapatkan pemasukan 35 miliyar per tahun.\n Pada saat Walt Disney berusia 16 tahun, beliau mengakhiri tahap belajar formalnya di sekolah. Alhasil, Beliau hanya mengerjakan tugas utamanya membantu ayahnya di pabrik koran. Setelah itu, Walt Disney memutuskan untuk bergabung dengan Angkatan bersenjata AS di usia 16 tahun. Namun ia ditolak di angkatan bersenjata AS, beliau kemudian bergabung di Palang Merah dan diterima disana.\n Kehidupan sulit mulai kembali di hidup Walt Disney. Beliau kembali mengingat impiannya di masa lalu, beliau ingin menjadi kaya. Sejak saat itulah, beliau berusaha bangkit. dan menyadari satu hal yang masih dimilikinya dan menjadi satu satu nya harapan yang ada adalah bakat menggambarnya. Beliau menemukan sebuah ide cemerlang. Hollywood adalah ide yang terlintas di pikirannya. Walt memutuskan untuk mengadu nasib di Hollywood.\n Walt Disney memulai perjuangannya di kacah hiburan hollywood dengan masuk satu persatu ke studio studio di sana. Menawarkan diri untuk bekerja di profesi apapun asalkan berhubungan dengan dunia perfilman. tak ada satupun tawarannya yang diterima oleh satu studio sekalipun. Bahkan untuk pekerjaan yang paling rendah sekalipun.\n Dari situlah beliau belajar lebih keras untuk mengembangkan bakatnya, beliau membeli beberapa kertas kosong dan mulai menggambar. Satu, dua, tiga hingga beberapa karya muncul. Setelah yakin atas karya yang di buatnya, beliau kembali mendatangi satu persatu studio yang ada di Hollywood. Namun kali ini berbeda dari sebelumnya. Sebelumnya beliau tak membawa bukti akan bakat terpendamnya, namun kini ia membawa karya-karya yang menjadi andalannya.\n Ternyata trick membawa karya adalah satu hal yang tebukti jitu untuk mendapatkan pekerjaan di Hollywood. Karena ada satu studio yang tertarik dengan karya Walt yang menggambarkan bakat Walt Disney yang luar biasa. Alhasil, studio itu segera memesan satu cerita “Alice in Wonderland” dalam bentuk film.\n Walt mulai bisa memperbaiki hidupnya. Membeli rumah, membuat studio sendiri dan memperbaiki kehidupan pribadinya, yakni membentuk keluarga bersama Lilian Bounds.\n Walt Disney termotivasi untuk menciptakan sesuatu yang baru dan benar-benar orisinil. Walt Disney membuat karakter lucu, sebuah makhluk kecil cerdik yang dikenal dengan nama Mickey Mouse sebuah nama yang diberikan oleh istrinya Lilian Bounds. Sesaat setelah mickey mouse meluncur di dunia hiburan. Dengan sekejap karakter ini menjadi bintang tenar di seluruh penjuru dunia, dan bahkan lebih terkenal dibanding bintang bintang Hollywood.\n Beliau semakin menyadari bahwa bidang ini adalah bidang yang paling cocok untuk dirinya. akhirnya ia memutuskan untuk terus melakukan yang terbaik demi terwujudnya karya yang lebih sempurna. Alhasil, beliau mengembangkan karya nya dalam skala yang lebih besar. Beliau membangun suatu yang dapat membantunya dalam menciptakan dan menawarkan produk produk layak tonton dan bermutu, yang kemudian beliau latih sendiri.\n Setahap demi tahap, beliau bergerak menjadi apa yang diinginkannya dahulu."
    }, 
    {
        "key" : "dennis-macAlistair-ritchie",
        "image" : "../../assets/image/8-des-2022/dennis-ritchie.jpeg",
        "title" : "Dennis MacAlistair Ritchie",
        "detail" :"Ritchie lahir pada 9 September 1941, di Bronx-ville, New York. Ia lahir dari Alistair Ritchie, seorang insinyur sistem switching untuk Bell Laboratories, dan Jean McGee Ritchie, seorang ibu rumah tangga. Ritchie dibesarkan di New Jersey, dan setelah masa kanak-kanak di mana ia melakukannya dengan sangat baik secara akademis, ia melanjutkan ke Universitas Harvard. Di sana ia belajar sains dan lulus dengan gelar sarjana dalam bidang fisika. Ketika dia masih bersekolah, Ritchie kebetulan menghadiri kuliah tentang bagaimana sistem komputer Harvard, sebuah Univac I, bekerja. Dia terpesona dengan apa yang didengarnya dan ingin mencari tahu lebih banyak. Di luar studinya di Harvard, Ritchie mulai mengeksplorasi komputer lebih menyeluruh, dan terutama tertarik pada bagaimana mereka diprogram.\n Saat masih di Harvard, Ritchie mendapat pekerjaan di Massachusetts Institute of Technology (MIT). Pada saat itu pemrograman komputer bukan gelar, dan laboratorium komputer sedang mencari siapa saja yang berpotensi untuk membantu komputer mereka. Ritchie, dengan keingintahuannya yang tak kunjung padam, tampak sempurna untuk pekerjaan itu. Ritchie bekerja di MIT selama bertahun-tahun membantu mengembangkan, bersama dengan ilmuwan lain, sistem komputer dan perangkat lunak yang lebih maju.\n Dia juga mulai bekerja mengembangkan sistem operasi untuk lebih banyak komputer jinjing. Sebagian besar komputer pada saat itu menempati seluruh ruangan dan memiliki akses dial-in yang terbatas, tetapi komputer desktop yang lebih kecil sedang dikembangkan, dan ini tidak mudah menggunakan sistem operasi. Ritchie memutuskan bahwa diperlukan. MIT, Honeywell, dan General Electric setuju, dan mengelola proyeknya. Ilmuwan lain dari perguruan tinggi dan perusahaan swasta datang untuk membantu membangun sistem, yang mampu menangani hingga seribu pengguna sekaligus dan dapat dijalankan 24 jam sehari. Ritchie tidak pernah melihat pemrograman sebagai masalah melainkan sebagai teka-teki yang harus dipecahkan.\n Setelah proyek selesai, hampir saat dia lulus, Ritchie menentukan bahwa komputer, bukan fisika, akan menjadi kariernya. Dia mendapat pekerjaan di Bell Labs, tempat ayahnya bekerja selama bertahun-tahun. Pada saat itu, pada tahun 1967, itu adalah penyedia telepon utama bangsa, dan memiliki salah satu laboratorium terbaik di dunia, yang bertanggung jawab untuk mengembangkan beragam kemajuan teknis, dari perangkat switching baru ke transistor, serta baru kemajuan komputer. Ritchie mengatakan kepada Investor’s Business Daily , “Alih-alih berfokus pada proyek-proyek tertentu, saya ingin berada di sekitar orang-orang dengan banyak pengalaman dan ide. Jadi saya mulai bekerja pada berbagai proyek untuk mempelajari cara saya dalam menjalankan profesi.”\nRitchie mulai bekerja dengan Kenneth Thompson, yang bergabung dengan Bell Labs pada tahun 1966. Keduanya telah menyaksikan bagaimana komputer mini menjadi semakin populer di awal tahun 1970-an. Apa yang dibutuhkan, menurut mereka, adalah interaksi yang lebih sederhana dan lebih masuk akal antara berbagai komputer. Butuh berbulan-bulan bagi mereka untuk menemukan solusi, tetapi ketika mereka selesai mereka telah menulis sistem operasi Unix. Sistem operasi diperlukan bagi pengguna untuk menyalin, menghapus, mengedit, dan mencetak file data. Ini memungkinkan seseorang untuk memindahkan data dari disk ke layar ke printer dan kembali ke disk untuk penyimpanan. Tanpa sistem operasi, komputer tidak akan dapat diakses oleh siapa pun kecuali beberapa ahli. Sebelum penciptaan Unix, sistem operasi telah rumit dan mahal. Unix relatif murah dan sederhana, dan dapat digunakan di hampir semua mesin, yang berarti pembeli tidak terjebak dengan perangkat lunak rumit yang menyertai komputer mereka. Mereka dapat membeli dan menginstal berbagai sistem perangkat lunak, karena Unix kompatibel dengan semuanya. Ini tidak mungkin terjadi sebelumnya.\n <h4>Pengembangan Bahasa Pemrograman C </h4>\n Unix ditulis dalam bahasa mesin, yang memiliki kosakata kecil dan tidak menangani banyak komputer dan ingatan mereka dengan baik. Jadi Ritchie menggabungkan beberapa aspek dari sistem lama dengan aspek yang baru, dan muncul dengan bahasa pemrograman “C”. Pada awal abad kedua puluh satu, “C” masih merupakan bahasa pemrograman komputer yang dominan. Itu adalah bahasa yang sederhana dan ringkas sehingga hampir setiap pembuat komputer saat itu beralih ke itu.\n “C” menggunakan sangat sedikit sintaks dan sedikit instruksi, tetapi sangat terstruktur dan modular. Karena itu mudah digunakan di komputer yang berbeda. Ada blok besar fungsi “C” yang sudah ditulis sehingga pemrogram dapat menyalin seluruh ke dalam program mereka sendiri tanpa harus mulai dari awal, membuatnya lebih cepat dan lebih mudah untuk diterapkan. Blok-blok ini mudah diakses, tersedia di perpustakaan sehingga pemrogram dapat mengaksesnya. Pada pertengahan 1980-an “C” telah menjadi salah satu bahasa pemrograman paling populer di dunia. Karena kecepatan yang digunakan “C” untuk menulis program dan menjalankannya, perusahaan mulai menggunakan “C” untuk mengembangkan perangkat lunak mereka sendiri.\n <h4> Lanjutan Drive untuk Meningkatkan Fungsi Komputer </h4>\n Pada tahun 1973, Ritchie dan Thompson telah menulis ulang sistem operasi Unix, menggunakan “C” alih-alih bahasa mesin, dan telah melakukan pengujian besar-besaran terhadapnya. Itu sangat sederhana untuk digunakan bahwa seluruh programer beralih ke mesin yang lebih kecil untuk melakukan pemrograman mereka, menyerahkan komputer yang lebih besar yang mereka pikir tidak akan pernah mau pergi. Bell Labs menjadi Lucent Technologies Inc., dan mulai menjual Unix kepada pengembang, menciptakan divisi baru untuk perusahaan. Ritchie telah memuji keberhasilannya sebagian karena fakta bahwa ia tidak memiliki latar belakang komputer dan oleh karena itu memiliki pikiran terbuka terhadap kemungkinan bahwa orang lain mungkin tidak berpikir ada.\n Ritchie menjadi pemimpin Departemen Riset Teknik Komputasi di Lucent Technologies pada 1990. Dalam peran itu ia menulis aplikasi dan mengelola pertumbuhan sistem operasi yang sudah dirilis. Selama bertahun-tahun Ritchie telah menerima banyak penghargaan, termasuk penghargaan ACM untuk makalah yang luar biasa pada tahun 1974 dalam sistem dan bahasa, Penghargaan IEEE Emmanuel Piore pada tahun 1982, Fellow Laboratorium Bell pada tahun 1983, Asosiasi untuk Mesin Komputasi Turing Award pada tahun 1983, sebuah ACM Software Systems Award pada tahun 1983, dan Medali IEEE Hamming pada tahun 1990. Ia juga terpilih untuk Akademi Teknik Nasional Amerika Serikat pada tahun 1988. Pada bulan April 1999 ia adalah penerima Medali Teknologi Nasional Amerika Serikat. Semua penghargaan yang diterima Ritchie bersamaan dengan Thompson. Ritchie sekarang adalah kepala Departemen Riset Perangkat Lunak Sistem Lucent Technologies, dan masih berusaha untuk membuat komputer bekerja lebih baik dan lebih mudah bagi pengguna."
    }, 
    {
        "key" : "anders-hejlsberg",
        "image" : "../../assets/image/8-des-2022/anders-hejlsberg.webp",
        "title" : "Anders Heljsberg",
        "detail" :"Hejlsberg lahir pada tanggal 2 Desember 1960 di Kopenhagen, Denmark dan belajar Teknik Elektro di Technical University of Denmark. Sementara di universitas pada tahun 1980, ia mulai menulis program untuk komputer mikro Nascom, termasuk kompiler Pascal yang awalnya dipasarkan sebagai Perangkat Lunak Label Biru Pascal untuk Nascom-2. Namun, dia segera menulis ulang untuk CP/M dan DOS, memasarkannya pertama kali sebagai Compas Pascal dan kemudian sebagai PolyPascal. Kemudian produk tersebut dilisensikan ke Borland, dan diintegrasikan ke dalam IDE untuk menjadi sistem Turbo Pascal. Turbo Pascal bersaing dengan PolyPascal. Kompiler itu sendiri sebagian besar terinspirasi oleh kompiler \"Tiny Pascal\" dalam \"Algoritma + Struktur Data = Program\" Niklaus Wirth, salah satu buku ilmu komputer paling berpengaruh saat itu.\n Hejlsberg dan mitranya mengelola toko komputer di Kopenhagen dan memasarkan sistem akuntansi. Perusahaan mereka, PolyData, adalah distributor produk Microsoft di Denmark yang membuat mereka berselisih dengan Borland. Philippe Kahn dan Hejlsberg pertama kali bertemu pada tahun 1986. Selama bertahun-tahun, Niels Jensen, salah satu pendiri Borland dan pemegang saham mayoritasnya, berhasil menangani hubungan antara Borland dan PolyData.\nDi tangan Borland, Turbo Pascal menjadi salah satu kompiler Pascal yang paling sukses secara komersial. Hejlsberg tetap bersama PolyData sampai perusahaan mengalami tekanan keuangan, pada saat itu, pada tahun 1989 dia pindah ke California dan menjadi Chief Engineer di Borland. Di sana dia tinggal sampai tahun 1996. Selama waktu ini dia mengembangkan Turbo Pascal lebih lanjut, dan akhirnya menjadi kepala arsitek untuk tim yang menghasilkan pengganti Turbo Pascal, Delphi.\nPada tahun 1996, Hejlsberg meninggalkan Borland dan bergabung dengan Microsoft. Salah satu pencapaian pertamanya adalah bahasa pemrograman J++ dan Windows Foundation Classes; dia juga menjadi Microsoft Distinguished Engineer dan Technical Fellow. Sejak tahun 2000, dia menjadi arsitek utama tim yang mengembangkan bahasa C#. Pada tahun 2012 Hejlsberg mengumumkan proyek Microsoft baru, TypeScript, sebuah superset dari JavaScript."
    }, 
    {
        "key" : "samuel-morse",
        "image" : "../../assets/image/8-des-2022/samuel-morse.jpg",
        "title" : "Samuel Finley Breese Morse",
        "detail" :"Saat berumur 4 tahun, Morse sangat gemar menggambar, Ia mulai mencoba menggambar wajah gurunya. Pada saat berumur 14 tahun, Morse mencoba mendapatkan uang sakunya sendiri dengan cara menggambar wajah teman-teman serta orang-orang yang ada di kotanya \n Saat menempuh pendidikan di Yale Collage, Morse bukanlah siswa yang pandai, ketertarikan pada sains timbul pada saat ia mengikuti kuliah tentang perkembangan terbaru kelistrikan. Tapi ia lebih merasa nyaman jika ia mnggambar potret-potret miniatur.\n  Pada suatu hari, Morse mengirimkan surat pada orang tuanya tentang keinginan Morse yang ingin menjadi pwlukis. Orang tua Morse tidak yakin dengan pilihan anaknya yang ingin menjadi seorang pelukis, mereka berpikir apakah Morse dapat memenuhi kebutuhan hidupnya dengan menjadi seorang pelukis. Orang tua Morse lalu menyuruh Morse menjadi penjual buku dan akhirnya Morse menjadi penjual buku namun tetap saja pada malam harinya Morse tetap melukis.\n  Menyadari kecintaan sang anak pada dunia seni, orang tua Morse mencoba mencari dan mengumpulkan uang untuk menyekolahkan Morse di sekolah seni di London.\n  Saat Morse berada di Royal Academy di Londen, guru selalu mengatakan bahwa Morse selalu belum mengerjakan tugasnya hingga sekitar 20 tugas gambar yang belum ia selesaikan dan hal tersebut tetap berulang. Akhirnya morse membuat model patung herkules dari tanah liat dan sang guru menyukai karyanya tersebut dan menyuruh Morse untuk menyertakannya dalam lomba, dalam lomba yang ia ikuti ia berhasil mendapatkan mendali emas.\n  Pada tahun 1818, Morse menikah dan memiliki 2 putra dan seorang putri. Pada tahun 1825, sang istri meninggal dunia karena serangan jantung. Morse tidak mengetahui apa yang terjadi pada sang istri dan kapan sang istri mninggal hingga hal tersebut membuatnya hampir putus asa dalam melukis.\n  Setelah itu, Morse dan beberapa orang pelukis lainnya mencoba mendirikan National Academy dan ialah yang menjadi presiden. Morse bekerja melukis dari pukul tujuh pagi hingga tengah malam. Morse berhasil terpilih sebagai pelukis di ruangan bundar di Capitol, Amerika. Satu dari empat lukisan dinding yang terpajang merupakan hasil karyanya.\n  Pada Oktober 1832, Morse bersama anak-anak dan kakak iparnya kembali ke Eropa untuk melanjutkan kariernya dalam dunia lukis. Morse dan keluarganya berlayar pulang kembali dari Eropa dengan kapal bernama Sully. Saat itu, Morse mendengar percakapan tentang penelitian elektromagnet yang baru ditemukan, dan kemudian muncul dalam benaknya tentang konsep telegraf elektrik.\n  Pada tahun 1835, Samuel Morse berhasil menciptakan telegraf pertamanya yang kemudian dioprasikan di gedung Universitas New York tempat ia mengajar seni. Pada tahun 1837, Morse dengan bantuan teman-temannya mengajukan hak paten atas telegraf barunya yang dilengkapi dengan penjelasan sandi yang terdiri yang terdiri dari titik dan garis yang mewakili angka dan mengubah angka tersebut menjadi kata-kata. Sandi tersebut disebut dengan Kode Morse.\n  Pada 24 Mei 1844, Morse mengirimkan pesan pertama melalui telegrafi Amerika, dari Washington ke Baltimore, dengan menggunakan kode Morse dengan kata: “What hath God wrought”.\n  Pada 2 April 1872 di New York, pada usia 80 tahun Morse meninggal dunia akibat penyakit pneumonia yang dideritanya. Kemudian Ia dimakamkan di pemakaman Greenwood, Brooklyn."
    }, 
    {
        "key" : "sergey-mikhailovich-brin",
        "image" : "../../assets/image/8-des-2022/sergey-brin.jpg",
        "title" : "Sergey Mikhailovich Brin",
        "detail" :"Sergey Mikhailovich Brin lahir di Moskow, Uni Soviet, 21 Agustus 1973 adalah seorang pengusaha Amerika. Brin mempelajari ilmu komputer dan matematika sebelum mendirikan Google dengan Larry Page. Brin adalah presiden teknologi pada Google dan mempunyai perkiraan kekayaan $18.7 milyar, yang membuatnya menjadi orang nomor 26 terkaya di dunia.\nSergey lahir  dari sebuah keluarga Yahudi. Ayahnya yang bernama Mikhail Brin dan ibunya Evgenia Brin adalah ahli matematika lulusan Moscow State University. Pada tahun 1979, ketika Brin berumur enam tahun, keluarganya pindah ke Amerika Serikat.\nSebagai anak ahli matematika, Sergey mengenyam pendidikan yang komplit. Pendidikan dasar  dia  dapat di sekolah elit Paint Branch Montossori, Adelphi, Maryland. Kemudian melanjutkan ke pendidikan menengah di Eleanor Roosevelt High School. Setelah lulus tahun 1990, Sergei melanjutkan ke jurusan ilmu komputer dan matematika di University of Maryland, College Park. Sergei meraih gelar Bachelor of Science pada tahun 1993. Lalu melanjutkan pada tingkat master di Stanford University Selain itu, ia juga sempat belajar bidang bisnis hingga menyabet gelar MBA dari IE Bussiness School.\nSergey Brin menggeluti dunia informasi dan komunikasi selama menjadi mahasiswa di Stanford. Brin menunjukkan ketertarikannya pada internet tak lama setelah diterima di Stanford. Dia menulis banyak paper yang membahas tentang data-mining dan pattern extraction. Dia juga menulis software yang dapat mengubah Text menjadi HTML untuk memudahkan tugas-tugasnya.\nDi Stanford, ia bertemu Larry Page tahun 1995 yang memiliki ketertarikan sama dalam bidang internet.  Dari sinilah search engine Google lahir. Page dan Brin kemudian bahu membahu, bekerja sama mendalami, menuangkan ide  hingga tercetuslah gagasan mengenai mesin pencari (search engine) untuk menemukan data-data, situs dan halaman web yang ada di dunia maya. Sergey dan Larry kemudian menulis sebuah karya berjudul \"The Anatomy of a Large-Scale Hypertextual Web Search Engine\". Karya ini ditengarahi sebagai pondasi berdirinya perusahaan mesin pencari yang mereka beri nama google."
    }, 
    {
        "key" : "steve-wozniak",
        "image" : "../../assets/image/8-des-2022/steve-wozniak.webp",
        "title" : "Stephen Gary Wozniak",
        "detail" :"Steve Wozniak , dengan nama Stephen Gary Wozniak, lahir 11 Agustus 1950, San Jose, California, AS. Ia adalah seorang Insinyur Elektronik di Amerika, salah satu pendiri, dengan Steve Jobs dari Apple Computer dan perancang komputer pribadi pertama yang sukses secara komersial.\nSteve Jobs  Wozniak—atau \"Woz\", begitu dia biasa dipanggil—adalah putra seorang Insinyur Listrik untuk Perusahaan Rudal dan Antariksa Lockheed di Sunnyvale, California, yang kemudian dikenal sebagai Silicon Valley. Seorang siswa dewasa sebelum waktunya tetapi tidak disiplin dengan bakat matematika dan minat pada elektronik, dia kuliah di Universitas Colorado di Boulder selama satu tahun (1968–69) sebelum akhirnya putus sekolah. Setelah kembali ke California, dia kuliah di community college lokal dan kemudian di University of California, Berkeley.\nPada tahun 1971 Wozniak merancang  \"Kotak Biru\", sebuah perangkat untuk phreaking (meretas ke dalam jaringan telepon tanpa membayar untuk panggilan jarak jauh) yang dia dan Jobs, seorang siswa di sekolah menengah lamanya yang dia temui sekitar waktu itu, mulai dijual ke murid lain. Juga selama awal 1970-an Wozniak bekerja di beberapa perusahaan elektronik kecil di wilayah Teluk San Francisco sebelum memperoleh posisi di Perusahaan Hewlett-Packard pada tahun 1975, saat dia secara resmi keluar dari Berkeley.\nWozniak juga terlibat dengan Homebrew Computer Club, sebuah kelompok wilayah Teluk San Francisco yang berpusat di sekitar perangkat komputer mikro yang didasarkan pada salah satu mikroprosesor pertama di dunia, Intel Corporation 8080, yang dirilis pada tahun 1975. Sementara itu ia bekerja sebagai pekerja magang teknik di Hewlett-Packard, Wozniak mendesain mikrokomputernya sendiri pada tahun 1976 menggunakan mikroprosesor baru, tetapi perusahaan tersebut tidak tertarik untuk mengembangkan desainnya. Jobs, yang juga anggota Homebrew, menunjukkan antusiasme yang besar terhadap desain Wozniak sehingga mereka memutuskan untuk bekerja sama, membentuk perusahaan mereka sendiri, Apple Computer. Modal awal mereka berasal dari penjualan mobil Jobs dan kalkulator Wozniak yang dapat diprogram, dan mereka memulai produksi di garasi keluarga Jobs untuk membuat papan sirkuit komputer mikro. Penjualan kit tersebut cukup menjanjikan, sehingga mereka memutuskan untuk memproduksi produk jadi, Apple II.\nApple II, yang menggabungkan teknik brilian Wozniak dengan selera estetika Jobs, adalah komputer pribadi pertama yang menarik perhatian. Ketika perusahaan mereka go public pada tahun 1980, nilai pasarnya melebihi $1 miliar, pada saat itu kenaikan tercepat ke tonggak sejarah perusahaan, dan saham Wozniak di perusahaan membuatnya menjadi multimiliuner instan."
    }
]